#include "global.h"

const u8 *const gMoveDescriptionPointers[] =
{
    // 拍击
    [0] = COMPOUND_STRING(
                "使用长长的尾巴或手等\n拍打对手攻击。"),
    // 空手劈
    [1] = COMPOUND_STRING(
                "用锋利的手刀劈向对手攻击。\n"
                "容易击中要害。"),
    // 连环巴掌
    [2] = COMPOUND_STRING(
                "用连环巴掌拍打对手攻击。\n"
                "连续攻击2～5次。"),
    // 连续拳
    [3] = COMPOUND_STRING(
                "用拳头怒涛般的殴打对手攻击。\n"
                "连续攻击2～5次。"),
    // 百万吨重拳
    [4] = COMPOUND_STRING(
                "用充满力量的拳头攻击对手。"),
    // 聚宝功
    [5] = COMPOUND_STRING(
                "向对手投掷小金币攻击。\n"
                "战斗后可以拿到钱。"),
    // 火焰拳
    [6] = COMPOUND_STRING(
                "用充满火焰的拳头攻击对手。\n"
                "有时会让对手陷入灼伤状态。"),
    // 冰冻拳
    [7] = COMPOUND_STRING(
                "用充满寒气的拳头攻击对手。\n"
                "有时会让对手陷入冰冻状态。"),
    // 雷电拳
    [8] = COMPOUND_STRING(
                "用充满电流的拳头攻击对手。\n"
                "有时会让对手陷入麻痹状态。"),
    // 抓
    [9] = COMPOUND_STRING(
                "用坚硬且无比锋利的爪\n子抓对手攻击。"),
    // 夹住
    [10] = COMPOUND_STRING(
                "将对手从两侧夹住，\n"
                "给予伤害。"),
    // 断头钳
    [11] = COMPOUND_STRING(
                "用钳子或剪刀夹断对手攻击。\n"
                "只要命中就会一击昏厥。"),
    // 旋风刀
    [12] = COMPOUND_STRING(
                "制造风之刃，于第2回合攻击\n对手。容易击中要害。"),
    // 剑舞
    [13] = COMPOUND_STRING(
                "激烈地跳起战舞提高气势。\n"
                "大幅提高自己的攻击。"),
    // 居合斩
    [14] = COMPOUND_STRING(
                "用镰刀或爪子等切斩\n对手攻击。"),
    // 起风
    [15] = COMPOUND_STRING(
                "用翅膀将刮起的狂风\n袭向对手攻击。"),
    // 翅膀攻击
    [16] = COMPOUND_STRING(
                "大大地展开美丽的翅膀，\n"
                "将其撞向对手攻击。"),
    // 吹飞
    [17] = COMPOUND_STRING(
                "吹飞对手使后备宝可梦上场。\n若是野生宝可梦将结束战斗。"),
    // 飞翔
    [18] = COMPOUND_STRING(
                "第1回合飞上天空，\n"
                "第2回合攻击对手。"),
    // 绑紧
    [19] = COMPOUND_STRING(
                "使用长长的身体或藤蔓等，\n"
                "在4～5回合内绑紧对手攻击。"),
    // 摔打
    [20] = COMPOUND_STRING(
                "使用长长的尾巴或藤蔓\n等摔打对手攻击。"),
    // 藤鞭
    [21] = COMPOUND_STRING(
                "用如同鞭子般弯曲细长\n的藤蔓摔打对手攻击。"),
    // 踩踏
    [22] = COMPOUND_STRING(
                "用大脚踩踏对手攻击。\n"
                "有时会使对手畏缩。"),
    // 二连踢
    [23] = COMPOUND_STRING(
                "用2只脚踢飞对手攻击。\n"
                "连续2次给予伤害。"),
    // 百万吨重踢
    [24] = COMPOUND_STRING(
                "使出力大无穷的重踢\n踢飞对手攻击。"),
    // 飞踢
    [25] = COMPOUND_STRING(
                "使出高高的腾空踢攻击对手。\n"
                "如果踢偏则自己会受到伤害。"),
    // 回旋踢
    [26] = COMPOUND_STRING(
                "边快速旋转，边踢飞对手\n攻击。有时会使对手畏缩。"),
    // 泼沙
    [27] = COMPOUND_STRING(
                "向对手脸上泼沙子，\n"
                "从而降低命中率。"),
    // 头锤
    [28] = COMPOUND_STRING(
                "将头伸出，笔直地扑向对手\n攻击。有时会使对手畏缩。"),
    // 角撞
    [29] = COMPOUND_STRING(
                "用尖锐的角攻击对手。"),
    // 乱击
    [30] = COMPOUND_STRING(
                "用角或喙刺向对手攻击。\n"
                "连续攻击2～5次。"),
    // 角钻
    [31] = COMPOUND_STRING(
                "用旋转的角刺入对手攻击。\n"
                "只要命中就会一击昏厥。"),
    // 撞击
    [32] = COMPOUND_STRING(
                "用整个身体撞向对手进\n行攻击。"),
    // 泰山压顶
    [33] = COMPOUND_STRING(
                "用整个身体压住对手攻击。\n"
                "有时会让对手陷入麻痹状态。"),
    // 紧束
    [34] = COMPOUND_STRING(
                "使用长长的身体或藤蔓等，\n"
                "在4～5回合内紧束对手攻击。"),
    // 猛撞
    [35] = COMPOUND_STRING(
                "以惊人的气势撞向对手攻击。\n"
                "自己也会受到少许伤害。"),
    // 大闹一番
    [36] = COMPOUND_STRING(
                "在2～3回合内乱打攻击对手。\n大闹一番后会陷入混乱。"),
    // 舍身冲撞
    [37] = COMPOUND_STRING(
                "拼命地猛撞向对手攻击。\n"
                "自己也会受到不小的伤害。"),
    // 摇尾巴
    [38] = COMPOUND_STRING(
                "可爱地左右摇尾巴，使对手\n大意。会降低对手的防御。"),
    // 毒针
    [39] = COMPOUND_STRING(
                "将有毒的针刺入对手攻击。\n"
                "有时会让对手陷入中毒状态。"),
    // 双针
    [40] = COMPOUND_STRING(
                "将2根针刺入对手，连续2次\n攻击。有时使对手中毒。"),
    // 飞弹针
    [41] = COMPOUND_STRING(
                "向对手发射锐针攻击。\n"
                "连续攻击2～5次。"),
    // 瞪眼
    [42] = COMPOUND_STRING(
                "用犀利的眼神使其害怕，\n"
                "从而降低对手的防御。"),
    // 咬住
    [43] = COMPOUND_STRING(
                "用尖锐的牙咬住对手攻击。\n"
                "有时会使对手畏缩。"),
    // 叫声
    [44] = COMPOUND_STRING(
                "让对手听可爱的叫声，\n使其疏忽，降低攻击。"),
    // 吼叫
    [45] = COMPOUND_STRING(
                "强制后备宝可梦上场。\n若为野生宝可梦结束战斗。"),
    // 唱歌
    [46] = COMPOUND_STRING(
                "让对手听舒适、美妙的歌声，\n"
                "从而陷入睡眠状态。"),
    // 超音波
    [47] = COMPOUND_STRING(
                "从身体发出特殊的音波，\n"
                "从而使对手混乱。"),
    // 音爆
    [48] = COMPOUND_STRING(
                "将冲击波撞向对手攻击。\n"
                "必定会给予 20 的伤害。"),
    // 定身法
    [49] = COMPOUND_STRING(
                "阻碍对手行动，之前的招式\n"
                "将在4回合内无法使用。"),
    // 溶解液
    [50] = COMPOUND_STRING(
                "将强酸泼向对手攻击。\n"
                "有时会降低对手的特防。"),
    // 火花
    [51] = COMPOUND_STRING(
                "向对手发射小型火焰攻击。\n"
                "有时会让对手陷入灼伤状态。"),
    // 喷射火焰
    [52] = COMPOUND_STRING(
                "向对手发射烈焰攻击。\n"
                "有时会让对手陷入灼伤状态。"),
    // 白雾
    [53] = COMPOUND_STRING(
                "用白雾覆盖身体。在5回合内\n"
                "不会让对手降低自己的能力。"),
    // 水枪
    [54] = COMPOUND_STRING(
                "向对手猛烈地喷射水流\n攻击。"),
    // 水炮
    [55] = COMPOUND_STRING(
                "向对手猛烈地喷射大量\n水流攻击。"),
    // 冲浪
    [56] = COMPOUND_STRING(
                "利用大浪攻击自己周围\n所有的宝可梦。"),
    // 冰冻光束
    [57] = COMPOUND_STRING(
                "向对手发射冰冻光束攻击。\n"
                "有时会让对手陷入冰冻状态。"),
    // 暴风雪
    [58] = COMPOUND_STRING(
                "将猛烈的暴风雪刮向对手攻击。\n"
                "有时会让对手陷入冰冻状态。"),
    // 幻象光线
    [59] = COMPOUND_STRING(
                "向对手发射神奇的光线攻击。\n"
                "有时会使对手混乱。"),
    // 泡沫光线
    [60] = COMPOUND_STRING(
                "向对手猛烈地喷射泡沫攻击。\n"
                "有时会降低对手的速度。"),
    // 极光束
    [61] = COMPOUND_STRING(
                "向对手发射虹色光束攻击。\n"
                "有时会降低对手的攻击。"),
    // 破坏光线
    [62] = COMPOUND_STRING(
        "使出强力的攻击，但是"
        "下一回合自己将无法动弹。"),
    // 啄
    [63] = COMPOUND_STRING(
                "用尖锐的喙或角刺向对\n手攻击。"),
    // 啄钻
    [64] = COMPOUND_STRING(
                "边旋转边将尖喙，\n"
                "刺入对手攻击。"),
    // 地狱翻滚
    [65] = COMPOUND_STRING(
                "将对手同自己一起摔向地面。\n"
                "自己也会受到少许伤害。"),
    // 踢倒
    [66] = COMPOUND_STRING(
                "用力踢对手的脚，使其摔倒\n攻击。对手越重，威力越大。"),
    // 双倍奉还
    [67] = COMPOUND_STRING(
                "从对手那里受到物理攻击\n的伤害将以2倍返还。"),
    // 地球上投
    [68] = COMPOUND_STRING(
                "利用引力将对手甩飞出去。\n"
                "造成和自己等级相同的伤害。"),
    // 怪力
    [69] = COMPOUND_STRING(
                "使出浑身力气殴打对手\n攻击。"),
    // 吸取
    [70] = COMPOUND_STRING(
                "吸取对手的养分攻击。\n"
                "可以回复伤害的一半HP。"),
    // 超级吸取
    [71] = COMPOUND_STRING(
                "可以回复给予对手\n"
                "伤害的一半HP"),
    // 寄生种子
    [72] = COMPOUND_STRING(
                "在每回合一点点吸取\n对手的HP，来回复HP。"),
    // 生长
    [73] = COMPOUND_STRING(
                "让身体一下子长大，\n"
                "从而提高攻击和特攻。"),
    // 飞叶快刀
    [74] = COMPOUND_STRING(
                "飞出叶片，切斩对手进行\n攻击。容易击中要害。"),
    // 日光束
    [75] = COMPOUND_STRING(
                "第1回合收集满满的日光，\n"
                "第2回合发射光束攻击。"),
    // 毒粉
    [76] = COMPOUND_STRING(
                "撒出毒粉，\n"
                "从而让对手陷入中毒状态。"),
    // 麻痹粉
    [77] = COMPOUND_STRING(
                "撒出麻痹粉，\n"
                "从而让对手陷入麻痹状态。"),
    // 催眠粉
    [78] = COMPOUND_STRING(
                "撒出催眠粉，\n"
                "从而让对手陷入睡眠状态。"),
    // 花瓣舞
    [79] = COMPOUND_STRING(
                "在2～3回合内散落花瓣攻击\n对手。之后自己会陷入混乱。"),
    // 吐丝
    [80] = COMPOUND_STRING(
                "用口中吐出的丝缠绕对手，\n"
                "从而大幅降低对手的速度。"),
    // 龙之怒
    [81] = COMPOUND_STRING(
                "将愤怒冲击波撞向对手攻击。\n"
                "必定会给予 40 的伤害。"),
    // 火焰旋涡
    [82] = COMPOUND_STRING(
                "将对手困在火焰旋涡中，\n"
                "在4～5回合内攻击。"),
    // 电击
    [83] = COMPOUND_STRING(
                "发出电流刺激对手攻击。\n"
                "有时会让对手陷入麻痹状态。"),
    // 十万伏特
    [84] = COMPOUND_STRING(
                "向对手发出强力电击攻击。\n"
                "有时会让对手陷入麻痹状态。"),
    // 电磁波
    [85] = COMPOUND_STRING(
                "向对手发出微弱的电击，\n"
                "从而让对手陷入麻痹状态。"),
    // 打雷
    [86] = COMPOUND_STRING(
                "向对手劈下暴雷攻击。\n"
                "有时会让对手陷入麻痹状态。"),
    // 落石
    [87] = COMPOUND_STRING(
                "拿起小岩石，\n"
                "投掷对手攻击。"),
    // 地震
    [88] = COMPOUND_STRING(
                "利用地震的冲击，\n"
                "攻击自己周围所有的宝可梦。"),
    // 地裂
    [89] = COMPOUND_STRING(
                "让对手掉落于地裂的裂缝中。\n"
                "只要命中就会一击昏厥。"),
    // 挖洞
    [90] = COMPOUND_STRING(
                "第1回合钻入地底，\n"
                "第2回合攻击对手。"),
    // 剧毒
    [91] = COMPOUND_STRING(
                "让对手陷入剧毒状态。\n中毒伤害会逐渐增加。"),
    // 念力
    [92] = COMPOUND_STRING(
                "向对手发送微弱的念力攻击。\n"
                "有时会使对手混乱。"),
    // 精神强念
    [93] = COMPOUND_STRING(
                "向对手发送强大的念力攻击。\n"
                "有时会降低对手的特防。"),
    // 催眠术
    [94] = COMPOUND_STRING(
                "施以诱导睡意的暗示，\n"
                "让对手陷入睡眠状态。"),
    // 瑜伽姿势
    [95] = COMPOUND_STRING(
                "唤醒身体深处沉睡的力量，\n"
                "从而提高自己的攻击。"),
    // 高速移动
    [96] = COMPOUND_STRING(
                "让身体放松变轻，以高速\n移动。大幅提高自己的速度。"),
    // 电光一闪
    [97] = COMPOUND_STRING(
                "以迅雷不及掩耳之势扑向\n"
                "对手。必定能够先制攻击。"),
    // 愤怒
    [98] = COMPOUND_STRING(
                "如果在使出招式后受到攻击，\n"
                "会因愤怒的力量而提高攻击。"),
    // 瞬间移动
    [99] = COMPOUND_STRING(
                "有后备宝可梦时进行替换。\n若是野生宝可梦则会逃走。"),
    // 黑夜魔影
    [100] = COMPOUND_STRING(
                "显示恐怖幻影，\n"
                "给予自己等级相同的伤害。"),
    // 模仿
    [101] = COMPOUND_STRING(
                "可以将对手最后使用的招式，\n"
                "在战斗内变成自己的招式。"),
    // 刺耳声
    [102] = COMPOUND_STRING(
                "发出令人捂起耳朵的刺耳声，\n"
                "从而大幅降低对手的防御。"),
    // 影子分身
    [103] = COMPOUND_STRING(
                "通过快速移动来制造分身，\n扰乱对手从而提高闪避率。"),
    // 自我再生
    [104] = COMPOUND_STRING(
                "让细胞再生，\n"
                "从而回复自己最大HP的一半。"),
    // 变硬
    [105] = COMPOUND_STRING(
                "全身使劲，让身体变硬，\n从而提高自己的防御。"),
    // 变小
    [106] = COMPOUND_STRING(
                "蜷缩身体显得很小，\n"
                "从而大幅提高自己的闪避率。"),
    // 烟幕
    [107] = COMPOUND_STRING(
                "向对手喷出烟或墨汁等，\n"
                "从而降低对手的命中率。"),
    // 奇异之光
    [108] = COMPOUND_STRING(
                "显示奇怪的光，扰乱对手。\n使对手混乱。"),
    // 缩入壳中
    [109] = COMPOUND_STRING(
                "缩入壳里保护身体，\n"
                "从而提高自己的防御。"),
    // 变圆
    [110] = COMPOUND_STRING(
                "将身体蜷曲变圆，\n"
                "从而提高自己的防御。"),
    // 屏障
    [111] = COMPOUND_STRING(
                "制造坚固的壁障，\n"
                "从而大幅提高自己的防御。"),
    // 光墙
    [112] = COMPOUND_STRING(
                "利用神奇的墙壁，在5回合\n"
                "内减弱特殊攻击的伤害。"),
    // 黑雾
    [113] = COMPOUND_STRING(
                "升起黑雾，\n"
                "将全体宝可梦能力变回原点。"),
    // 反射壁
    [114] = COMPOUND_STRING(
                "利用神奇的墙壁，在5回合\n"
                "内减弱物理攻击的伤害。"),
    // 聚气
    [115] = COMPOUND_STRING(
                "深深地吸口气，集中精神。\n攻击会变得容易击中要害。"),
    // 忍耐
    [116] = COMPOUND_STRING(
                "在2回合内忍受攻击，受到的\n"
                "伤害会2倍返还给对手。"),
    // 挥指
    [117] = COMPOUND_STRING(
                "挥动手指刺激自己的大脑，\n"
                "从许多招式中随机使出1个。"),
    // 鹦鹉学舌
    [118] = COMPOUND_STRING(
                "模仿对手使用的招式，\n"
                "自己也使用相同招式。"),
    // 自爆
    [119] = COMPOUND_STRING(
                "引发爆炸，攻击周围所有的\n宝可梦。使用后陷入昏厥。"),
    // 炸蛋
    [120] = COMPOUND_STRING(
                "向对手用力投掷大大的\n蛋攻击。"),
    // 舌舔
    [121] = COMPOUND_STRING(
                "用长舌头舔遍对手攻击。\n有时会让对手陷入麻痹状态。"),
    // 浊雾
    [122] = COMPOUND_STRING(
                "将肮脏的浓雾吹向对手攻击。\n"
                "有时会让对手陷入中毒状态。"),
    // 污泥攻击
    [123] = COMPOUND_STRING(
                "用污泥投掷对手攻击。\n"
                "有时会让对手陷入中毒状态。"),
    // 骨棒
    [124] = COMPOUND_STRING(
                "用手中的骨头殴打对手攻击。\n"
                "有时会使对手畏缩。"),
    // 大字爆炎
    [125] = COMPOUND_STRING(
                "用大字形状的火焰烧尽对手。\n"
                "有时会让对手陷入灼伤状态。"),
    // 攀瀑
    [126] = COMPOUND_STRING(
                "以惊人的气势扑向对手。\n"
                "有时会使对手畏缩。"),
    // 贝壳夹击
    [127] = COMPOUND_STRING(
                "用非常坚固且厚实的贝壳，\n"
                "在4～5回合内夹住对手攻击。"),
    // 高速星星
    [128] = COMPOUND_STRING(
                "发射星形的光攻击对手。\n"
                "攻击必定会命中。"),
    // 火箭头锤
    [129] = COMPOUND_STRING(
                "第1回合把头缩进去，提高\n防御。第2回合攻击对手。"),
    // 尖刺加农炮
    [130] = COMPOUND_STRING(
                "向对手发射锐针攻击。\n"
                "连续攻击2～5次。"),
    // 缠绕
    [131] = COMPOUND_STRING(
                "用触手或青藤等缠绕攻击。\n"
                "有时会降低对手的速度。"),
    // 瞬间失忆
    [132] = COMPOUND_STRING(
                "将头脑清空，瞬间忘记某事，\n从而大幅提高自己的特防。"),
    // 折弯汤匙
    [133] = COMPOUND_STRING(
                "折弯汤匙引开注意，\n"
                "从而降低对手的命中率。"),
    // 生蛋
    [134] = COMPOUND_STRING(
                "回复自己最大HP的一半。"),
    // 飞膝踢
    [135] = COMPOUND_STRING(
                "跳起后用膝盖撞对手攻击。\n"
                "如果撞偏则自己会受到伤害。"),
    // 大蛇瞪眼
    [136] = COMPOUND_STRING(
                "用腹部的花纹使对手害怕，\n"
                "从而让其陷入麻痹状态。"),
    // 食梦
    [137] = COMPOUND_STRING(
                "吃掉正在睡觉的对手的梦。\n"
                "回复造成伤害的一半HP。"),
    // 毒瓦斯
    [138] = COMPOUND_STRING(
                "将毒瓦斯吹到对手的脸上，\n"
                "从而让对手陷入中毒状态。"),
    // 投球
    [139] = COMPOUND_STRING(
                "向对手投掷圆形物体攻击。\n"
                "连续攻击2～5次。"),
    // 吸血
    [140] = COMPOUND_STRING(
                "吸取血液攻击对手。\n"
                "可以回复给予伤害的一半HP。"),
    // 恶魔之吻
    [141] = COMPOUND_STRING(
                "用恐怖的脸强吻对手。\n"
                "让对手陷入睡眠状态。"),
    // 神鸟猛击
    [142] = COMPOUND_STRING(
                "第2回合攻击对手。偶尔使对\n手畏缩。也容易击中要害。"),
    // 变身
    [143] = COMPOUND_STRING(
                "变身成对手宝可梦的样子，\n"
                "能够使用和对手相同的招式。"),
    // 泡沫
    [144] = COMPOUND_STRING(
                "向对手猛烈地喷射泡沫攻击。\n"
                "有时会降低对手的速度。"),
    // 迷昏拳
    [145] = COMPOUND_STRING(
                "有节奏地出拳攻击对手。\n"
                "有时会使对手混乱。"),
    // 蘑菇孢子
    [146] = COMPOUND_STRING(
                "撒满具有催眠效果的孢子，\n"
                "从而让对手陷入睡眠状态。"),
    // 闪光
    [147] = COMPOUND_STRING(
                "使出光芒降低对手的命中率。\n也可在暗窟里照亮四周。"),
    // 精神波
    [148] = COMPOUND_STRING(
                "向对手发射神奇的念波攻击。\n每次使用，伤害都会改变。"),
    // 跃起
    [149] = COMPOUND_STRING(
                "也不攻击只是一蹦一蹦\n地跳，什么都不会发生\n……"),
    // 溶化
    [150] = COMPOUND_STRING(
                "通过细胞的变化进行液化，\n"
                "从而大幅提高自己的防御。"),
    // 蟹钳锤
    [151] = COMPOUND_STRING(
                "用大钳子敲打对手攻击。\n"
                "容易击中要害。"),
    // 大爆炸
    [152] = COMPOUND_STRING(
                "引发大爆炸攻击周围所有的\n宝可梦。使用后会陷入昏厥。"),
    // 乱抓
    [153] = COMPOUND_STRING(
                "用爪子或镰刀等抓对手攻击。\n"
                "连续攻击2～5次。"),
    // 骨头回力镖
    [154] = COMPOUND_STRING(
                "用手中的骨头投掷对手，\n"
                "来回连续2次给予伤害。"),
    // 睡觉
    [155] = COMPOUND_STRING(
                "连续睡上2回合。回复全部\n"
                "HP以及治愈所有异常状态。"),
    // 岩崩
    [156] = COMPOUND_STRING(
                "将岩石猛烈地撞向对手攻击。\n"
                "有时会使对手畏缩。"),
    // 必杀门牙
    [157] = COMPOUND_STRING(
                "用锋利门牙牢牢地咬住对手。\n"
                "有时会使对手畏缩。"),
    // 棱角化
    [158] = COMPOUND_STRING(
                "增加身体变得棱棱角角，\n从而提高自己的攻击。"),
    // 纹理
    [159] = COMPOUND_STRING(
                "将自己的属性转换成和\n第一个招式相同的属性。"),
    // 三重攻击
    [160] = COMPOUND_STRING(
                "用3种光线攻击。有时会让\n"
                "对手陷入麻痹、灼伤或冰冻。"),
    // 愤怒门牙
    [161] = COMPOUND_STRING(
                "用锋利门牙猛烈地咬住对手。\n"
                "对手的HP减半。"),
    // 劈开
    [162] = COMPOUND_STRING(
                "用爪子或镰刀劈开对手攻击。\n"
                "容易击中要害。"),
    // 替身
    [163] = COMPOUND_STRING(
                "削减自己的HP制造分身。\n分身将成为自己的替身。"),
    // 挣扎
    [164] = COMPOUND_STRING(
                "当PP耗尽时，努力挣扎攻击\n对手。自己也会受到伤害。"),
    // 写生
    [165] = COMPOUND_STRING(
                "将对手招式变成自己的招式。\n"
                "使用1次后写生消失。"),
    // 三连踢
    [166] = COMPOUND_STRING(
                "连续3次踢对手攻击。每\n踢中一次，威力就会提高。"),
    // 小偷
    [167] = COMPOUND_STRING(
                "攻击时盗取道具。当自己\n携带道具时，不会去盗取。"),
    // 蛛网
    [168] = COMPOUND_STRING(
                "将黏糊糊细丝层层缠住对手，\n"
                "使其不能从战斗中逃走。"),
    // 心之眼
    [169] = COMPOUND_STRING(
                "用心感受对手的行动，\n"
                "下次攻击必定会击中对手。"),
    // 恶梦
    [170] = COMPOUND_STRING(
                "让在睡眠状态的对手做恶梦，\n"
                "每回合会缓缓减少 HP。"),
    // 火焰轮
    [171] = COMPOUND_STRING(
                "让火焰覆盖全身，猛撞向对手。\n有时会让对手陷入灼伤状态。"),
    // 打鼾
    [172] = COMPOUND_STRING(
                "在自己睡觉时，发出噪音\n攻击。有时会使对手畏缩。"),
    // 诅咒
    [173] = COMPOUND_STRING(
                "自身属性是幽灵属性\n或其他属性时效果会不同。"),
    // 抓狂
    [174] = COMPOUND_STRING(
                "抓狂般乱打攻击。自己\nHP越少，招式的威力越大。"),
    // 纹理２
    [175] = COMPOUND_STRING(
            "为抵抗对手最后使用的招式，\n"
            "从而使自己的属性发生变化。"),
    // 气旋攻击
    [176] = COMPOUND_STRING(
                "发射空气旋涡攻击。\n"
                "容易击中要害。"),
    // 棉孢子
    [177] = COMPOUND_STRING(
                "将棉花般柔软孢子紧贴对手，\n"
                "从而大幅降低对手的速度。"),
    // 起死回生
    [178] = COMPOUND_STRING(
                "竭尽全力攻击。自己的\nHP越少，招式的威力越大。"),
    // 怨恨
    [179] = COMPOUND_STRING(
                "怨恨对手最后用的招式，\n"
                "减少4PP该招式。"),
    // 细雪
    [180] = COMPOUND_STRING(
                "将冰冷的细雪吹向对手攻击。\n"
                "有时会让对手陷入冰冻状态。"),
    // 守住
    [181] = COMPOUND_STRING(
                "完全抵挡对手的攻击。\n"
                "连续使出则容易失败。"),
    // 音速拳
    [182] = COMPOUND_STRING(
                "以迅雷不及掩耳之势出拳。\n"
                "必定能够先制攻击。"),
    // 鬼面
    [183] = COMPOUND_STRING(
                "用恐怖表情瞪着对手使其\n害怕，大幅降低对手的速度。"),
    // Faint Attack
    [184] = COMPOUND_STRING(
                "能够攻击使用守住类招式的\n"
                "对手。解除其守护效果。"),
    // 天使之吻
    [185] = COMPOUND_STRING(
                "像天使般可爱地亲吻对手，\n"
                "从而使对手混乱。"),
    // 腹鼓
    [186] = COMPOUND_STRING(
                "削减自己HP至最大HP一半，\n"
                "从而最大限度提高自身攻击。"),
    // 污泥炸弹
    [187] = COMPOUND_STRING(
                "用污泥投掷对手攻击。\n"
                "有时会让对手陷入中毒状态。"),
    // 掷泥
    [188] = COMPOUND_STRING(
                "向对手的脸等投掷泥块攻击。\n"
                "会降低对手的命中率。"),
    // 章鱼桶炮
    [189] = COMPOUND_STRING(
                "向对手的脸等喷出墨汁攻击。\n"
                "有时会降低对手的命中率。"),
    // 撒菱
    [190] = COMPOUND_STRING(
                "在对手的脚下扔撒菱。\n"
                "对替换的宝可梦给予伤害。"),
    // 电磁炮
    [191] = COMPOUND_STRING(
                "发射大炮一样的电流攻击。\n"
                "让对手陷入麻痹状态。"),
    // 识破
    [192] = COMPOUND_STRING(
                "对幽灵宝可梦无效的招式及\n"
                "高闪避率对手，变得能够打中。"),
    // 同命
    [193] = COMPOUND_STRING(
                "当陷入昏厥时，对手也会\n一同昏厥。连续使出会失败。"),
    // 灭亡之歌
    [194] = COMPOUND_STRING(
                "倾听歌声的宝可梦经过3回合\n"
                "陷入昏厥。替换后效果消失。"),
    // 冰冻之风
    [195] = COMPOUND_STRING(
                "将结冰的冷气吹向对手攻击。\n"
                "会降低对手的速度。"),
    // 看穿
    [196] = COMPOUND_STRING(
                "完全抵挡对手的攻击。\n"
                "连续使出则容易失败。"),
    // 骨棒乱打
    [197] = COMPOUND_STRING(
                "用坚硬的骨头殴打对手攻击。\n"
                "连续攻击2～5次。"),
    // 锁定
    [198] = COMPOUND_STRING(
                "紧紧瞄准对手，\n"
                "下次攻击必定会打中。"),
    // 逆鳞
    [199] = COMPOUND_STRING(
                "在2～3回合内，乱打一气地\n攻击。大闹一番后陷入混乱。"),
    // 沙暴
    [200] = COMPOUND_STRING(
                "在5回合内扬起沙暴，除岩石\n地面钢以外宝可梦都会受伤。"),
    // 终极吸取
    [201] = COMPOUND_STRING(
                "吸取对手的养分攻击。\n"
                "可以回复给予伤害的一半HP。"),
    // 挺住
    [202] = COMPOUND_STRING(
                "即使受到攻击也至会留下\n1HP。连续使出则容易失败。"),
    // 撒娇
    [203] = COMPOUND_STRING(
                "可爱地凝视，诱使对手大意\n，从而大幅降低对手的攻击。"),
    // 滚动
    [204] = COMPOUND_STRING(
                "在5回合内连续滚动攻击。\n招式每次击中，威力会提高。"),
    // 点到为止
    [205] = COMPOUND_STRING(
        "对手至少会留下1HP，\n"
        "如此般手下留情地攻击。"
        ),
    // 虚张声势
    [206] = COMPOUND_STRING(
                "激怒对手使其混乱。因愤怒\n，对手的攻击会大幅提高。"),
    // 喝牛奶
    [207] = COMPOUND_STRING(
                "回复自己最大HP的一半。"),
    // 电光
    [208] = COMPOUND_STRING(
                "以迅雷不及掩耳之势扑向\n"
                "对手。必定能够先制攻击。"),
    // 连斩
    [209] = COMPOUND_STRING(
                "用镰刀或爪子切斩对手攻击。\n连续击中，威力就会提高。"),
    // 钢翼
    [210] = COMPOUND_STRING(
                "用坚硬的翅膀敲打对手攻击。\n"
                "有时会提高自己的防御。"),
    // 黑色目光
    [211] = COMPOUND_STRING(
                "以黑色目光持续地凝视对手，\n"
                "使其不能从战斗中逃走。"),
    // 迷人
    [212] = COMPOUND_STRING(
                "诱惑异性，让对手着迷。\n对手将很难使出招式。"),
    // 梦话
    [213] = COMPOUND_STRING(
                "从招式中任意使出1个。\n"
                "只能在自己睡觉时使用。"),
    // 治愈铃声
    [214] = COMPOUND_STRING(
                "让同伴听舒适的铃音，\n"
                "治愈我方全员的异常状态。"),
    // 报恩
    [215] = COMPOUND_STRING(
                "为了训练家而全力攻击对手。\n亲密度越高，威力越大。"),
    // 礼物
    [216] = COMPOUND_STRING(
                "递给对手设圈套的盒子攻击。\n"
                "也有可能回复对手HP。"),
    // 迁怒
    [217] = COMPOUND_STRING(
                "为了发泄不满而全力攻击。\n亲密度越低，威力越大。"),
    // 神秘守护
    [218] = COMPOUND_STRING(
                "在5回合内被神奇力量守护，\n"
                "从而不会陷入异常状态。"),
    // 分担痛楚
    [219] = COMPOUND_STRING(
                "将自己的HP和对手的HP相加，\n"
                "然后自己和对手友好地平分。"),
    // 神圣之火
    [220] = COMPOUND_STRING(
                "用神秘的火焰烧尽对手攻击。\n"
                "有时会让对手陷入灼伤状态。"),
    // 震级
    [221] = COMPOUND_STRING(
                "晃动地面，攻击所有宝可梦。\n招式的威力会有变化。"),
    // 爆裂拳
    [222] = COMPOUND_STRING(
                "使出浑身力气出拳攻击。\n"
                "必定会使对手混乱。"),
    // 超级角击
    [223] = COMPOUND_STRING(
                "用坚硬且华丽的角狠狠\n地刺入对手攻击。"),
    // 龙息
    [224] = COMPOUND_STRING(
                "将强烈的气息吹向对手攻击。\n"
                "有时会让对手陷入麻痹状态。"),
    // 接棒
    [225] = COMPOUND_STRING(
                "和后备宝可梦替换。换上的\n"
                "宝可梦能继承能力的变化。"),
    // 再来一次
    [226] = COMPOUND_STRING(
                "让对手接受再来一次，\n"
                "连续3次使出最后用的招式。"),
    // 追打
    [227] = COMPOUND_STRING(
                "当对手替换宝可梦上场时，\n"
                "能够以2倍的威力攻击。"),
    // 高速旋转
    [228] = COMPOUND_STRING(
                "通过旋转攻击。可摆脱绑紧\n紧束等招式并提高速度。"),
    // 甜甜香气
    [229] = COMPOUND_STRING(
                "用香气大幅降低对手的\n闪避率。"),
    // 铁尾
    [230] = COMPOUND_STRING(
                "使用坚硬的尾巴摔打对手攻击。\n"
                "有时会降低对手的防御。"),
    // 金属爪
    [231] = COMPOUND_STRING(
                "用钢铁之爪劈开对手攻击。\n"
                "有时会提高自己的攻击。"),
    // 借力摔
    [232] = COMPOUND_STRING(
                "会在对手之后攻击。\n"
                "但是自己的攻击必定会命中。"),
    // 晨光
    [233] = COMPOUND_STRING(
                "回复自己的HP。根据天气不\n同，回复量也会有所变化。"),
    // 光合作用
    [234] = COMPOUND_STRING(
                "回复自己的HP。根据天气不\n同，回复量也会有所变化。"),
    // 月光
    [235] = COMPOUND_STRING(
                "回复自己的HP。根据天气不\n同，回复量也会有所变化。"),
    // 觉醒力量
    [236] = COMPOUND_STRING(
                "招式的属性会随着使用\n此招式的宝可梦而改变。"),
    // 十字劈
    [237] = COMPOUND_STRING(
                "用两手呈十字劈打对手攻击。\n"
                "容易击中要害。"),
    // 龙卷风
    [238] = COMPOUND_STRING(
                "兴起龙卷风，将对手卷入\n攻击。有时会使对手畏缩。"),
    // 求雨
    [239] = COMPOUND_STRING(
                "在5回合内一直降雨，提高水\n招式威力。降低火招式威力。"),
    // 大晴天
    [240] = COMPOUND_STRING(
                "在5回合内日照强烈，提高火\n招式威力。降低水招式威力。"),
    // 咬碎
    [241] = COMPOUND_STRING(
                "用利牙咬碎对手攻击。\n"
                "有时会降低对手的防御。"),
    // 镜面反射
    [242] = COMPOUND_STRING(
                "从对手那里受到特殊攻击的\n伤害将以2倍返还对手。"),
    // 自我暗示
    [243] = COMPOUND_STRING(
                "向自己施以自我暗示，\n"
                "将能力变化变得和对手一样。"),
    // 神速
    [244] = COMPOUND_STRING(
                "以迅雷不及掩耳之势猛撞向\n"
                "对手。必定能够先制攻击。"),
    // 原始之力
    [245] = COMPOUND_STRING(
                "用原始之力攻击。\n"
                "有时会提高自己所有的能力。"),
    // 暗影球
    [246] = COMPOUND_STRING(
                "投掷一团黑影攻击。\n"
                "有时会降低对手的特防。"),
    // 预知未来
    [247] = COMPOUND_STRING(
                "在使用招式2回合后，\n"
                "向对手发送一团念力攻击。"),
    // 碎岩
    [248] = COMPOUND_STRING(
                "用拳头攻击。\n"
                "有时会降低对手的防御。"),
    // 潮旋
    [249] = COMPOUND_STRING(
                "将对手困在激烈水流旋涡中，\n"
                "在4～5回合内攻击。"),
    // 围攻
    [250] = COMPOUND_STRING(
                "我方全员攻击。同行宝可梦\n越多，攻击次数越多。"),
    // 击掌奇袭
    [251] = COMPOUND_STRING(
                "进行先制攻击，使对手畏缩。\n仅出场后立刻使出才能成功。"),
    // 吵闹
    [252] = COMPOUND_STRING(
                "在3回合内大吵大闹攻击。\n"
                "在此期间谁都不能入眠。"),
    // 蓄力
    [253] = COMPOUND_STRING(
                "积蓄力量，提高自己的防御\n和特防。最多积蓄3次。"),
    // 喷出
    [254] = COMPOUND_STRING(
                "将积蓄的力量撞向对手攻击。\n积蓄得越多，威力越大。"),
    // 吞下
    [255] = COMPOUND_STRING(
                "将积蓄的力量吞下从而回复\nHP。积蓄得越多，回复越多。"),
    // 热风
    [256] = COMPOUND_STRING(
                "将炎热的气息吹向对手攻击。\n"
                "有时会让对手陷入灼伤状态。"),
    // 冰雹
    [257] = COMPOUND_STRING(
                "在5回合内降下冰雹，冰属\n性以外的宝可梦会受到伤害。"),
    // 无理取闹
    [258] = COMPOUND_STRING(
                "向对手无理取闹，\n令其不能"
                "连续2次使出相同招式。"),
    // 吹捧
    [259] = COMPOUND_STRING(
                "吹捧对手，使其混乱。同时\n还会提高对手的特攻。"),
    // 鬼火
    [260] = COMPOUND_STRING(
                "放出怪异的火焰，\n"
                "从而让对手陷入灼伤状态。"),
    // 临别礼物
    [261] = COMPOUND_STRING(
                "使自己陷入昏厥，但能\n"
                "大幅降低对手攻击和特攻。"),
    // 硬撑
    [262] = COMPOUND_STRING(
                "当处于中毒、麻痹、灼伤时，\n招式威力会变成2倍。"),
    // 真气拳
    [263] = COMPOUND_STRING(
                "集中精神出拳。在招式使出前\n"
                "若受到攻击则会失败。"),
    // 清醒
    [264] = COMPOUND_STRING(
                "对于麻痹的对手，威力变成2倍。\n但对手的麻痹也会被治愈。"),
    // 看我嘛
    [265] = COMPOUND_STRING(
                "引起对手的注意，\n"
                "将对手攻击转移到自身上。"),
    // 自然之力
    [266] = COMPOUND_STRING(
                "用自然之力攻击。根据\n场所不同，招式也会有所变化。"),
    // 充电
    [267] = COMPOUND_STRING(
                "变为充电状态，提高下次的\n电招式威力并提高自身特防。"),
    // 挑衅
    [268] = COMPOUND_STRING(
                "使对手愤怒。在3回合内让\n"
                "对手只能用给予伤害的招式。"),
    // 帮助
    [269] = COMPOUND_STRING(
                "帮助伙伴。被帮助的宝可梦，\n其招式威力变得比平时大。"),
    // 戏法
    [270] = COMPOUND_STRING(
                "抓住对手的空隙，\n"
                "交换自己和对手的持有物。"),
    // 扮演
    [271] = COMPOUND_STRING(
                "扮演对手，让自己的特性\n"
                "变得和对手相同。"),
    // 祈愿
    [272] = COMPOUND_STRING(
                "下回合回复自己或换上\n的宝可梦最大HP的一半。"),
    // 借助
    [273] = COMPOUND_STRING(
                "向同伴紧急求助，从我方\n"
                "宝可梦招式中随机使用1个。"),
    // 扎根
    [274] = COMPOUND_STRING(
                "在地上扎根，每回合回复\nHP。但不能替换宝可梦。"),
    // 蛮力
    [275] = COMPOUND_STRING(
                "发挥惊人的力量攻击对手。\n"
                "自己的攻击和防御会降低。"),
    // 魔法反射
    [276] = COMPOUND_STRING(
                "当对手使出会变化类招式时，\n"
                "会将对手的招式反射回去。"),
    // 回收利用
    [277] = COMPOUND_STRING(
                "使战斗中已经消耗的持有\n"
                "物再生，并可以再次使用。"),
    // 报复
    [278] = COMPOUND_STRING("如果受到对手的招式攻击，\n"
                "就能给予对手2倍的伤害。"),
    // 劈瓦
    [279] = COMPOUND_STRING(
                "将手刀猛烈地挥下攻击对手。\n"
                "还可以破坏光墙和反射壁等。"),
    // 哈欠
    [280] = COMPOUND_STRING(
                "打个大哈欠引起睡意。\n"
                "在下回合让对手睡眠。"),
    // 拍落
    [281] = COMPOUND_STRING(
                "拍落持有物，使其不能使用。\n对手携带道具时会增加伤害。"),
    // 蛮干
    [282] = COMPOUND_STRING(
                "给予伤害，使对手的HP\n"
                "变得和自己的HP一样。"),
    // 喷火
    [283] = COMPOUND_STRING(
                "爆发怒火攻击对手。自己HP\n越少，招式的威力越小。"),
    // 特性互换
    [284] = COMPOUND_STRING(
                "利用超能力互换自己和\n对手的特性。"),
    // 封印
    [285] = COMPOUND_STRING(
                "如果对手有和自己相同招式，\n"
                "那么对手将无法使用该招式。"),
    // 焕然一新
    [286] = COMPOUND_STRING(
                "让身体休息，\n"
                "治愈自己的异常状态。"),
    // 怨念
    [287] = COMPOUND_STRING(
                "陷入昏厥时给对手施加怨念，\n"
                "让该招式的PP变成0。"),
    // 抢夺
    [288] = COMPOUND_STRING(
                "将对手要使用的回复招式或\n能力变化招式夺为己用。"),
    // 秘密之力
    [289] = COMPOUND_STRING(
                "根据使用场所不同，\n"
                "招式的追加效果也会改变。"),
    // 潜水
    [290] = COMPOUND_STRING(
                "第1回合潜入水中，\n"
                "第2回合浮上来攻击。"),
    // 猛推
    [291] = COMPOUND_STRING(
                "张开双手猛推对手攻击。\n"
                "连续攻击2～5次。"),
    // 保护色
    [292] = COMPOUND_STRING(
                "根据所在场所不同，\n可以改变自己的属性。"),
    // 萤火
    [293] = COMPOUND_STRING(
                "凝视闪烁的光芒，集中自身\n精神，从而巨幅提高特攻。"),
    // 洁净光芒
    [294] = COMPOUND_STRING(
                "释放耀眼的光芒攻击。\n"
                "有时会降低对手的特防。"),
    // 薄雾球
    [295] = COMPOUND_STRING(
                "用围绕着雾状羽毛的球攻击。\n"
                "有时会降低对手的特攻。"),
    // 羽毛舞
    [296] = COMPOUND_STRING(
                "撒出羽毛笼罩在对手周围。\n大幅降低对手的攻击。"),
    // 摇晃舞
    [297] = COMPOUND_STRING(
                "摇摇晃晃地跳起舞蹈，\n"
                "让周围的宝可梦陷入混乱。"),
    // 火焰踢
    [298] = COMPOUND_STRING(
                "攻击对手后，有时会使其\n灼伤。也容易击中要害。"),
    // 玩泥巴
    [299] = COMPOUND_STRING(
                "弄得周围到处是泥。\n在5回合内减弱电属性的招式。"),
    // 冰球
    [300] = COMPOUND_STRING(
                "在5回合内攻击对手。招式每\n次击中，威力就会提高。"),
    // 尖刺臂
    [301] = COMPOUND_STRING(
                "用带刺的手臂猛烈挥舞攻击。\n"
                "有时会使对手畏缩。"),
    // 偷懒
    [302] = COMPOUND_STRING(
                "偷懒休息。\n"
                "回复自己最大HP的一半。"),
    // 巨声
    [303] = COMPOUND_STRING(
                "给予对手又吵又响的巨大\n震动攻击。"),
    // 剧毒牙
    [304] = COMPOUND_STRING(
                "用有毒的牙齿咬住对手攻击。\n"
                "有时会使对手中剧毒。"),
    // 撕裂爪
    [305] = COMPOUND_STRING(
                "用坚硬的锐爪劈开对手攻击。\n"
                "有时会降低对手的防御。"),
    // 爆炸烈焰
    [306] = COMPOUND_STRING(
                "用爆炸的火焰烧尽对手攻击。\n"
                "下一回合自己将无法动弹。"),
    // 加农水炮
    [307] = COMPOUND_STRING(
                "向对手喷射水炮攻击。\n"
                "下一回合自己将无法动弹。"),
    // 彗星拳
    [308] = COMPOUND_STRING(
                "使出彗星般的拳头攻击对手。\n"
                "有时会提高自己的攻击。"),
    // 惊吓
    [309] = COMPOUND_STRING(
                "用尖叫声突然惊吓对手攻击。\n"
                "有时会使对手畏缩。"),
    // 气象球
    [310] = COMPOUND_STRING(
                "根据使用时的天气，\n"
                "招式属性和威力会改变。"),
    // 芳香治疗
    [311] = COMPOUND_STRING(
                "让同伴闻沁人心脾的香气，\n"
                "治愈我方全员的异常状态。"),
    // 假哭
    [312] = COMPOUND_STRING(
                "装哭流泪。使对手不知所措，\n从而大幅降低对手的特防。"),
    // 空气利刃
    [313] = COMPOUND_STRING(
                "用锐利的风切斩对手攻击。\n"
                "容易击中要害。"),
    // 过热
    [314] = COMPOUND_STRING(
                "使出全部力量攻击对手。\n之后自己的特攻大幅降低。"),
    // 气味侦测
    [315] = COMPOUND_STRING(
                "对幽灵宝可梦以及闪避率高\n"
                "对手，变得能够打中。"),
    // 岩石封锁
    [316] = COMPOUND_STRING(
                "投掷岩石攻击。封住对手\n的行动，从而降低速度。"),
    // 银色旋风
    [317] = COMPOUND_STRING(
                "在风中掺入鳞粉攻击对手。\n"
                "有时会提高自己的全部能力。"),
    // 金属音
    [318] = COMPOUND_STRING(
                "发出摩擦金属般讨厌的声音。\n"
                "大幅降低对手的特防。"),
    // 草笛
    [319] = COMPOUND_STRING(
                "让对手听舒适的笛声，\n"
                "从而陷入睡眠状态。"),
    // 挠痒
    [320] = COMPOUND_STRING(
                "给对手挠痒，使其发笑，\n降低对手的攻击和防御。"),
    // 宇宙力量
    [321] = COMPOUND_STRING(
                "汲取宇宙中神秘的力量，\n"
                "从而提高自己的防御和特防。"),
    // 喷水
    [322] = COMPOUND_STRING(
                "掀起潮水攻击。自己HP\n越少，招式的威力越小。"),
    // 信号光束
    [323] = COMPOUND_STRING(
                "发射神奇的光线攻击。\n"
                "有时会使对手混乱。"),
    // 暗影拳
    [324] = COMPOUND_STRING(
                "使出混影之拳。\n"
                "攻击必定会命中。"),
    // 神通力
    [325] = COMPOUND_STRING(
                "发出看不见的神奇力量攻击。\n"
                "有时会使对手畏缩。"),
    // 冲天拳
    [326] = COMPOUND_STRING(
                "用冲向天空般高高的上\n勾拳顶起对手攻击。"),
    // 流沙地狱
    [327] = COMPOUND_STRING(
                "将对手困在铺天盖地的沙中，\n"
                "在4～5回合内攻击。"),
    // 绝对零度
    [328] = COMPOUND_STRING(
                "给对手一击昏厥。若冰属性\n以外宝可梦使用会难以打中。"),
    // 浊流
    [329] = COMPOUND_STRING(
                "向对手喷射浑浊的水攻击。\n"
                "有时会降低对手的命中率。"),
    // 种子机关枪
    [330] = COMPOUND_STRING(
                "向对手猛烈地发射种子攻击。\n"
                "连续攻击2～5次。"),
    // 燕返
    [331] = COMPOUND_STRING(
                "以敏捷动作戏弄对手后切斩。\n"
                "攻击必定会命中。"),
    // 冰锥
    [332] = COMPOUND_STRING(
                "向对手发射锋利的冰柱攻击。\n"
                "连续攻击2～5次。"),
    // 铁壁
    [333] = COMPOUND_STRING(
                "将皮肤变得坚硬如铁，\n"
                "从而大幅提高自己的防御。"),
    // 挡路
    [334] = COMPOUND_STRING(
                "张开双手阻挡，封住对手\n的退路，使其不能逃走。"),
    // 长嚎
    [335] = COMPOUND_STRING(
                "大声吼叫提高气势，\n"
                "从而提高自己和同伴的攻击。"),
    // 龙爪
    [336] = COMPOUND_STRING(
                "用尖锐的巨爪劈开对手\n攻击。"),
    // 疯狂植物
    [337] = COMPOUND_STRING(
                "用大树摔打对手攻击。\n"
                "下一回合自己将无法动弹。"),
    // 健美
    [338] = COMPOUND_STRING(
                "使出全身力气绷紧肌肉，\n"
                "从而提高自己的攻击和防御。"),
    // 弹跳
    [339] = COMPOUND_STRING(
                "弹跳到高高的空中，第2回合\n攻击，有时会让对手陷入麻痹。"),
    // 泥巴射击
    [340] = COMPOUND_STRING(
                "向对手投掷泥块攻击。\n"
                "同时降低对手的速度。"),
    // 毒尾
    [341] = COMPOUND_STRING(
                "用尾巴拍打。有时会让对手\n中毒，也容易击中要害。"),
    // 渴望
    [342] = COMPOUND_STRING(
                "边撒娇边靠近对手攻击，\n还能夺取对手携带的道具。"),
    // 伏特攻击
    [343] = COMPOUND_STRING(
                "让电流覆盖全身猛撞。自己也\n会受伤。有时会让对手麻痹。"),
    // 魔法叶
    [344] = COMPOUND_STRING(
                "散落能追踪对手的神奇叶片。\n"
                "攻击必定会命中。"),
    // 玩水
    [345] = COMPOUND_STRING(
                "用水湿透周围。\n"
                "在5回合内减弱火属性招式。"),
    // 冥想
    [346] = COMPOUND_STRING(
                "静心凝神，\n"
                "从而提高自己的特攻和特防。"),
    // 叶刃
    [347] = COMPOUND_STRING(
                "像用剑般操纵叶片切斩对手。\n"
                "容易击中要害。"),
    // 龙之舞
    [348] = COMPOUND_STRING(
                "激烈地跳起神秘有力的舞蹈。\n"
                "从而提高自己的攻击和速度。"),
    // 岩石爆击
    [349] = COMPOUND_STRING(
                "向对手发射坚硬的岩石攻击。\n"
                "连续攻击2～5次。"),
    // 电击波
    [350] = COMPOUND_STRING(
                "向对手快速发出电击。\n"
                "攻击必定会命中。"),
    // 水之波动
    [351] = COMPOUND_STRING(
                "用水的震动攻击对手。\n"
                "有时会使对手混乱。"),
    // 破灭之愿
    [352] = COMPOUND_STRING(
                "使用招式2回合后，\n"
                "会用无数道光束攻击对手。"),
    // 精神突进
    [353] = COMPOUND_STRING(
                "使出全部力量攻击对手。\n之后自己的特攻大幅降低。"),
    // 羽栖
    [354] = COMPOUND_STRING(
                "降到地面，使身体休息。回\n复自己最大HP的一半。"),
    // 重力
    [355] = COMPOUND_STRING(
                "在5回合内飘浮和飞行宝可梦\n会被地招式击中，无法飞空。"),
    // 奇迹之眼
    [356] = COMPOUND_STRING(
                "使出后对恶宝可梦以及闪避率\n"
                "高的对手，变得能够打中。"),
    // 唤醒巴掌
    [357] = COMPOUND_STRING(
                "给予睡眠对手较大的伤害。\n"
                "但对手会从睡眠中醒过来。"),
    // 臂锤
    [358] = COMPOUND_STRING(
                "挥舞强力而沉重的拳头，给予\n对手伤害。自身速度会降低。"),
    // 陀螺球
    [359] = COMPOUND_STRING(
                "让身体高速旋转并撞击对手。\n速度比对手越慢，威力越大。"),
    // 治愈之愿
    [360] = COMPOUND_STRING("虽然自己陷入昏厥，但后备\n"
            "上场宝可梦会治愈并回复HP。"),
    // 盐水
    [361] = COMPOUND_STRING(
                "当对手的HP一半以下时，\n"
                "招式威力会变成2倍。"),
    // 自然之恩
    [362] = COMPOUND_STRING(
                "从树果上获得力量攻击。根据\n携带树果改变招式属性威力。"),
    // 佯攻
    [363] = COMPOUND_STRING(
                "能够攻击到使用守住类招式\n"
                "的对手。解除其守护效果。"),
    // 啄食
    [364] = COMPOUND_STRING("当对手携带树果时，\n"
                "可以食用并获得其效果。"),
    // 顺风
    [365] = COMPOUND_STRING(
                "刮起猛烈的旋风，在4回合内\n"
                "提高我方全员的速度。"),
    // 点穴
    [366] = COMPOUND_STRING(
                "通过点穴让身体舒筋活络。\n"
                "大幅提高某1项能力。"),
    // 金属爆炸
    [367] = COMPOUND_STRING(
                "使出招式前，将最后受到的\n"
                "招式的伤害大力返还给对手。"),
    // 急速折返
    [368] = COMPOUND_STRING("在攻击之后急速返回，\n"
                "和后备宝可梦进行替换。"),
    // 近身战
    [369] = COMPOUND_STRING("强力攻击，但是自己的\n"
                "防御和特防会降低。"),
    // 以牙还牙
    [370] = COMPOUND_STRING(
                "蓄力攻击。如果能在对手后\n攻击，招式威力会变成2倍。"),
    // 恶意追击
    [371] = COMPOUND_STRING(
                "如果此回合对手已受伤害，\n"
                "招式威力会变成2倍。"),
    // 查封
    [372] = COMPOUND_STRING(
                "对手5回合内不能使用道具。\n"
                "训练家也不能对其使用道具。"),
    // 投掷
    [373] = COMPOUND_STRING(
                "快速投掷携带的道具攻击。\n威力效果会根据道具改变。"),
    // 精神转移
    [374] = COMPOUND_STRING(
                "利用超能力施以暗示，将自己\n"
                "的异常状态转移给对手。"),
    // 王牌
    [375] = COMPOUND_STRING(
                "王牌招式的剩余 PP 越少，\n"
                "招式的威力越大。"),
    // 回复封锁
    [376] = COMPOUND_STRING(
                "在5回合内无法通过招式、\n特性或携带道具回复 HP。"),
    // 绞紧
    [377] = COMPOUND_STRING("对手的HP越多，\n"
            "威力越大。"),
    // 力量戏法
    [378] = COMPOUND_STRING(
                "利用超能力交换自己的\n攻击和防御的力量。"),
    // 胃液
    [379] = COMPOUND_STRING(
                "将胃液吐向对手的身体。\n"
                "沾上的胃液会消除对手特性。"),
    // 幸运咒语
    [380] = COMPOUND_STRING(
                "向天许愿，在5回合内不会\n"
                "被对手的攻击打中要害。"),
    // 抢先一步
    [381] = COMPOUND_STRING(
                "提高威力，抢先使出对手\n的招式。如果不先使出则会失败。"),
    // 仿效
    [382] = COMPOUND_STRING(
                "模仿对手使出的招式，使出相\n同招式。对手没出招则会失败。"),
    // 力量互换
    [383] = COMPOUND_STRING(
                "利用超能力互换自己和对手\n的攻击以及特攻的能力变化。"),
    // 防守互换
    [384] = COMPOUND_STRING(
                "利用超能力互换自己和对手\n的防御以及特防的能力变化。"),
    // 惩罚
    [385] = COMPOUND_STRING(
                "根据能力变化，对手提高的\n力量越大，招式的威力越大。"),
    // 珍藏
    [386] = COMPOUND_STRING(
                "当其他招式全部使用过后，\n"
                "才能开始使出珍藏的招式。"),
    // 烦恼种子
    [387] = COMPOUND_STRING(
                "种植心神不宁的种子。\n使对手特性变成不眠。"),
    // 突袭
    [388] = COMPOUND_STRING("能比对手先攻击。对手招式\n"
            "如果不是攻击招式则会失败。"),
    // 毒菱
    [389] = COMPOUND_STRING(
                "在对手的脚下撒毒菱。\n"
                "使对手换上的宝可梦中毒。"),
    // 心灵互换
    [390] = COMPOUND_STRING(
                "利用超能力互换自己和\n对手之间的能力变化。"),
    // 水流环
    [391] = COMPOUND_STRING(
                "在自身体周围覆盖用水制造\n"
                "的幕。每回合回复HP。"),
    // 电磁飘浮
    [392] = COMPOUND_STRING(
                "用电气产生的磁力浮在空中。\n"
                "在5回合内可以飘浮。"),
    // 闪焰冲锋
    [393] = COMPOUND_STRING(
                "让火焰覆盖全身猛撞。自己\n也会受伤。有时让对手灼伤。"),
    // 发劲
    [394] = COMPOUND_STRING(
                "向对手发出冲击波攻击。\n"
                "有时会让对手陷入麻痹。"),
    // 波导弹
    [395] = COMPOUND_STRING(
                "从体内产生出波导之力，然\n后发出。攻击必定会命中。"),
    // 岩石打磨
    [396] = COMPOUND_STRING(
                "打磨自己的身体，减少空气\n阻力。大幅提高自己的速度。"),
    // 毒击
    [397] = COMPOUND_STRING(
                "用带毒触手或手臂刺入对手。\n"
                "有时会让对手陷入中毒状态。"),
    // 恶之波动
    [398] = COMPOUND_STRING(
                "从体内发出充满恶意的恐怖\n"
                "气场。有时会使对手畏缩。"),
    // 暗袭要害
    [399] = COMPOUND_STRING(
                "抓住瞬间的空隙切斩对手。\n"
                "容易击中要害。"),
    // 水流尾
    [400] = COMPOUND_STRING(
                "如惊涛骇浪般挥动大尾巴\n攻击对手。"),
    // 种子炸弹
    [401] = COMPOUND_STRING(
                "将外壳坚硬的大种子，\n"
                "从上方砸下攻击对手。"),
    // 空气斩
    [402] = COMPOUND_STRING(
                "用也能劈开天空的空气之刃\n"
                "攻击。有时会使对手畏缩。"),
    // 十字剪
    [403] = COMPOUND_STRING(
                "将镰刀或爪子像剪刀般地\n"
                "交叉，顺势劈开对手。"),
    // 虫鸣
    [404] = COMPOUND_STRING(
                "利用振动发出音波攻击。\n"
                "有时会降低对手的特防。"),
    // 龙之波动
    [405] = COMPOUND_STRING(
                "从大大的口中掀起冲击波\n攻击对手。"),
    // 龙之俯冲
    [406] = COMPOUND_STRING(
                "释放出骇人杀气，边威慑边\n撞击对手。有时会使对手畏缩。"),
    // 力量宝石
    [407] = COMPOUND_STRING(
                "发射如宝石般闪耀的光芒\n攻击对手。"),
    // 吸取拳
    [408] = COMPOUND_STRING(
                "可以回复给予对手\n"
                "伤害的一半HP"),
    // 真空波
    [409] = COMPOUND_STRING(
                "挥动拳头，掀起真空波。\n必定能够先制攻击。"),
    // 真气弹
    [410] = COMPOUND_STRING(
                "提高气势，释放出全部力量。\n有时会降低对手的特防。"),
    // 能量球
    [411] = COMPOUND_STRING(
                "发射从自然收集的生命力量。\n"
                "有时会降低对手的特防。"),
    // 勇鸟猛攻
    [412] = COMPOUND_STRING(
                "收拢翅膀低空飞行突击对手。\n自己也会受到不小的伤害。"),
    // 大地之力
    [413] = COMPOUND_STRING(
                "向对手脚下释放出大地之力。\n"
                "有时会降低对手的特防。"),
    // 掉包
    [414] = COMPOUND_STRING(
                "用一闪而过的速度交换\n自己和对手的持有物。"),
    // 终极冲击
    [415] = COMPOUND_STRING(
        "使出强力的攻击，但是"
        "下一回合自己将无法动弹。"),
    // 诡计
    [416] = COMPOUND_STRING(
                "谋划诡计，激活头脑。\n大幅提高自己的特攻。"),
    // 子弹拳
    [417] = COMPOUND_STRING(
                "使出如子弹般快速而坚硬\n"
                "的拳头。必定能够先制攻击。"),
    // 雪崩
    [418] = COMPOUND_STRING("如果受到对手的招式攻击，\n"
                "就能给予对手2倍的伤害。"),
    // 冰砾
    [419] = COMPOUND_STRING(
                "瞬间制作冰块，快速扔向对\n手。必定能够先制攻击。"),
    // 暗影爪
    [420] = COMPOUND_STRING(
                "以影子做成的锐爪，劈开\n对手。容易击中要害。"),
    // 雷电牙
    [421] = COMPOUND_STRING(
                "用蓄满电流的牙齿咬住对手。\n"
                "有时会使对手畏缩或麻痹。"),
    // 冰冻牙
    [422] = COMPOUND_STRING(
                "用藏有冷气的牙齿咬住对手。\n"
                "有时会使对手畏缩或冰冻。"),
    // 火焰牙
    [423] = COMPOUND_STRING(
                "用覆盖着火焰的牙齿咬住对手。\n"
                "有时会使对手畏缩或灼伤。"),
    // 影子偷袭
    [424] = COMPOUND_STRING(
                "伸长影子，从对手背后进行\n攻击。必定能够先制攻击。"),
    // 泥巴炸弹
    [425] = COMPOUND_STRING(
                "向对手发射坚硬的泥弹攻击。\n"
                "有时会降低对手的命中率。"),
    // 精神利刃
    [426] = COMPOUND_STRING(
                "用实体化的心之利刃劈开\n"
                "对手。容易击中要害。"),
    // 意念头锤
    [427] = COMPOUND_STRING(
                "将思念的力量集中在前额\n"
                "攻击。有时会使对手畏缩。"),
    // 镜光射击
    [428] = COMPOUND_STRING(
                "抛光身体向对手释放出闪光\n之力。有时会降低对手命中率。"),
    // 加农光炮
    [429] = COMPOUND_STRING(
                "将身体光芒聚集在一点释放\n"
                "出去。有时会降低对手特防。"),
    // 攀岩
    [430] = COMPOUND_STRING(
                "发动猛撞攻击，\n有时会使对手混乱。"),
    // 清除浓雾
    [431] = COMPOUND_STRING(
                "用强风吹开对手的墙壁招式。\n"
                "也会降低对手的闪避率。"),
    // 戏法空间
    [432] = COMPOUND_STRING(
                "制造出离奇空间。5回合内\n"
                "速度慢的宝可梦可以先行动。"),
    // 流星群
    [433] = COMPOUND_STRING(
                "从天空中向对手落下陨石。\n自己的特攻会大幅降低。"),
    // 放电
    [434] = COMPOUND_STRING(
                "用耀眼的电击攻击周围所有\n"
                "的宝可梦。有时会造成麻痹。"),
    // 喷烟
    [435] = COMPOUND_STRING(
                "用熊熊烈火攻击自己\n"
                "所有宝可梦。有时造成灼伤。"),
    // 飞叶风暴
    [436] = COMPOUND_STRING(
                "用尖叶片向对手卷起风暴。\n"
                "自己的特攻会大幅降低。"),
    // 强力鞭打
    [437] = COMPOUND_STRING(
                "激烈地挥舞青藤或触手\n摔打对手攻击。"),
    // 岩石炮
    [438] = COMPOUND_STRING(
                "使出强力的攻击，但是"
                "下一回合自己将无法动弹。"),
    // 十字毒刃
    [439] = COMPOUND_STRING(
                "用毒刃劈开对手。有时会让\n对手中毒，也容易击中要害。"),
    // 垃圾射击
    [440] = COMPOUND_STRING(
                "用肮脏的垃圾撞向对手攻击。\n"
                "有时会让对手陷入中毒状态。"),
    // 铁头
    [441] = COMPOUND_STRING(
                "用钢铁般坚硬的头部攻击。\n"
                "有时会使对手畏缩。"),
    // 磁铁炸弹
    [442] = COMPOUND_STRING(
                "发射吸住对手的钢铁炸弹。\n"
                "攻击必定会命中。"),
    // 尖石攻击
    [443] = COMPOUND_STRING(
                "用尖尖的岩石刺入对手攻击。\n"
                "容易击中要害。"),
    // 诱惑
    [444] = COMPOUND_STRING(
                "诱惑异性，\n"
                "从而大幅降低对手的特攻。"),
    // 隐形岩
    [445] = COMPOUND_STRING(
                "将无数岩石悬浮在对手周围，\n"
                "对换上的宝可梦给予伤害。"),
    // 打草结
    [446] = COMPOUND_STRING(
                "用草缠住并绊倒对手。\n对手越重，威力越大。"),
    // 喋喋不休
    [447] = COMPOUND_STRING(
                "用非常烦人喋喋不休\n的音波攻击对手。使对手混乱。"),
    // 制裁光砾
    [448] = COMPOUND_STRING(
                "向对手放出无数的光弹。\n"
                "属性会根据携带石板而改变。"),
    // 虫咬
    [449] = COMPOUND_STRING("当对手携带树果时，\n"
                "可以食用并获得其效果。"),
    // 充电光束
    [450] = COMPOUND_STRING(
                "向对手发射电击光束。\n有时会提高自己的特攻。"),
    // 木槌
    [451] = COMPOUND_STRING(
                "用坚硬的躯体撞击对手攻击。\n"
                "自己也会受到不小的伤害。"),
    // 水流喷射
    [452] = COMPOUND_STRING(
                "以迅雷不及掩耳之势扑向\n"
                "对手。必定能够先制攻击。"),
    // 攻击指令
    [453] = COMPOUND_STRING(
                "召唤手下，让其朝对手发起\n攻击。容易击中要害。"),
    // 防御指令
    [454] = COMPOUND_STRING(
                "召唤手下附在自己身体上。\n可以提高自己的防御和特防。"),
    // 回复指令
    [455] = COMPOUND_STRING(
                "召唤手下疗伤。\n"
                "回复自己最大 HP 的一半。"),
    // 双刃头锤
    [456] = COMPOUND_STRING(
                "拼命向对手进行头锤攻击。\n自己也会受到非常大的伤害。"),
    // 二连击
    [457] = COMPOUND_STRING(
                "使用尾巴等拍打对手攻击。\n"
                "连续2次给予伤害。"),
    // 时光咆哮
    [458] = COMPOUND_STRING(
                "释放扭曲时间般的强大力量。\n"
                "下一回合自己将无法动弹。"),
    // 亚空裂斩
    [459] = COMPOUND_STRING(
                "将对手连同周围的空间一起\n"
                "撕裂。容易击中要害。"),
    // 新月舞
    [460] = COMPOUND_STRING("虽然自己陷入昏厥，但后备\n"
            "上场宝可梦会治愈并回复HP。"),
    // 捏碎
    [461] = COMPOUND_STRING("对手的HP越多，\n"
            "威力越大。"),
    // 熔岩风暴
    [462] = COMPOUND_STRING(
                "将对手困在熊熊燃烧火焰中，\n"
                "在4～5回合内攻击。"),
    // 暗黑洞
    [463] = COMPOUND_STRING(
                "将对手强制拖入黑暗的世界，\n"
                "从而让对手陷入睡眠状态。"),
    // 种子闪光
    [464] = COMPOUND_STRING(
                "从身体里产生冲击波。\n"
                "有时会大幅降低对手的特防。"),
    // 奇异之风
    [465] = COMPOUND_STRING(
                "突然刮起毛骨悚然的暴风。\n"
                "有时会提高自己的全部能力。"),
    // 暗影潜袭
    [466] = COMPOUND_STRING("第1回合消失踪影，\n"
    "第2回合攻击对手。"),
    // 磨爪
    [467] = COMPOUND_STRING(
                "将爪子磨得更加锋利。\n"
                "提高自己的攻击和命中率。"),
    // 广域防守
    [468] = COMPOUND_STRING(
                "在1回合内防住击打\n我方全员的攻击。"),
    // 防守平分
    [469] = COMPOUND_STRING(
                "利用超能力将自己和对手的\n"
                "防御和特防相加再进行平分。"),
    // 力量平分
    [470] = COMPOUND_STRING(
                "利用超能力将自己和对手的\n"
                "攻击和特攻相加再进行平分。"),
    // 奇妙空间
    [471] = COMPOUND_STRING(
                "制造出离奇空间。在5回合内\n"
                "互换所有宝可梦防御和特防。"),
    // 精神冲击
    [472] = COMPOUND_STRING("将念波实体化攻击对手。\n"
                "给予物理伤害。"),
    // 毒液冲击
    [473] = COMPOUND_STRING(
                "将特殊的毒液泼向对手。对\n中毒的对手，威力会变成2倍。"),
    // 身体轻量化
    [474] = COMPOUND_STRING(
                "削掉身体上没用部分。大幅\n提高自身速度，并减轻体重。"),
    // 愤怒粉
    [475] = COMPOUND_STRING(
                "将令人烦躁的粉末撒在自身，\n使对手的攻击全部指向自己。"),
    // 意念移物
    [476] = COMPOUND_STRING(
                "利用超能力使对手浮起来。\n"
                "在3回合内攻击会容易命中。"),
    // 魔法空间
    [477] = COMPOUND_STRING(
                "制造出离奇空间。在5回合内\n"
                "所有携带道具效果都会消失。"),
    // 击落
    [478] = COMPOUND_STRING(
                "扔石头或炮弹，击落飞行的\n对手，使其掉到地面。"),
    // 山岚摔
    [479] = COMPOUND_STRING("攻击必定会击中要害。"),
    // 烈焰溅射
    [480] = COMPOUND_STRING(
                "如果击中，爆裂的火焰会\n飞溅到旁边的对手。"),
    // 污泥波
    [481] = COMPOUND_STRING(
                "用污泥波攻击周围所有的\n"
                "宝可梦。有时会造成中毒。"),
    // 蝶舞
    [482] = COMPOUND_STRING(
                "轻巧跳起神秘而美丽的舞蹈。\n"
                "提高自己特攻、特防和速度。"),
    // 重磅冲撞
    [483] = COMPOUND_STRING("自己比对手越重，\n"
                "威力越大。"),
    // 同步干扰
    [484] = COMPOUND_STRING(
                "用神奇电波对周围所有\n同属性宝可梦给予伤害。"),
    // 电球
    [485] = COMPOUND_STRING(
                "用电气团撞向对手。自己\n比对手速度越快，威力越大。"),
    // 浸水
    [486] = COMPOUND_STRING(
                "将大量的水泼向对手，\n"
                "从而使其变成水属性。"),
    // 蓄能焰袭
    [487] = COMPOUND_STRING(
                "让火焰覆盖全身，攻击对手。\n积蓄力量提高自己的速度。"),
    // 盘蜷
    [488] = COMPOUND_STRING(
                "盘蜷集中精神。提高自己的\n"
                "攻击、防御和命中率。"),
    // 下盘踢
    [489] = COMPOUND_STRING(
                "以敏捷的动作瞄准对手的脚\n"
                "攻击。会降低对手的速度。"),
    // 酸液炸弹
    [490] = COMPOUND_STRING(
                "喷出能溶化对手的液体攻击。\n"
                "会大幅降低对手的特防。"),
    // 欺诈
    [491] = COMPOUND_STRING(
                "利用对手的力量攻击。\n对手攻击越高，伤害越大。"),
    // 单纯光束
    [492] = COMPOUND_STRING(
                "向对手发送谜之念波。接收\n到的对手特性会变为单纯。"),
    // 找伙伴
    [493] = COMPOUND_STRING(
                "用神奇的节奏跳舞。使对手\n的特性变成一样。"),
    // 您先请
    [494] = COMPOUND_STRING(
                "支援我方或对手的行动，\n"
                "使其紧接着此招式之后行动。"),
    // 轮唱
    [495] = COMPOUND_STRING(
                "用歌声攻击对手。大家一起\n可以接连使用，威力也会提高。"),
    // 回声
    [496] = COMPOUND_STRING(
                "用回声攻击对手。若每回合\n都有该招式使用威力就会提高。"),
    // 逐步击破
    [497] = COMPOUND_STRING("无视对手的能力变化，\n"
                "直接给予伤害。"),
    // 清除之烟
    [498] = COMPOUND_STRING(
                "向对手投掷特殊泥块攻击。\n"
                "使其能力变回原点。"),
    // 辅助力量
    [499] = COMPOUND_STRING(
                "用蓄积起来的力量攻击对手。\n能力提高得越多威力越大。"),
    // 快速防守
    [500] = COMPOUND_STRING(
                "守护自己和同伴，\n"
                "以防对手的先制攻击。"),
    // 交换场地
    [501] = COMPOUND_STRING(
                "用神奇力量瞬间移动与同伴\n交换位置。连续使出容易失败。"),
    // 热水
    [502] = COMPOUND_STRING(
                "向对手喷射煮得翻滚的开水。\n"
                "有时会让对手陷入灼伤状态。"),
    // 破壳
    [503] = COMPOUND_STRING(
                "打破外壳降低防御和特防，\n但大幅提高攻击特攻和速度。"),
    // 治愈波动
    [504] = COMPOUND_STRING(
                "放出治愈波动，\n"
                "从而回复对手最大HP的一半。"),
    // 祸不单行
    [505] = COMPOUND_STRING(
                "接二连三地攻击。对异常\n"
                "状态的对手给予较大的伤害。"),
    // 自由落体
    [506] = COMPOUND_STRING(
                "第1回合将对手带到空中，\n第2回合将其摔下攻击。"),
    // 换档
    [507] = COMPOUND_STRING(
                "转动齿轮，不仅提高自己的\n攻击，还会大幅提高速度。"),
    // 巴投
    [508] = COMPOUND_STRING("强制拉后备宝可梦上场。\n"
                "结束与野生宝可梦的战斗。"),
    // 烧尽
    [509] = COMPOUND_STRING(
                "用火焰攻击对手。会烧掉\n对手携带树果，使其不能使用。"),
    // 延后
    [510] = COMPOUND_STRING(
                "压制对手，\n"
                "从而将其行动顺序放到最后。"),
    // 杂技
    [511] = COMPOUND_STRING(
                "轻巧地攻击对手。自己没有\n携带道具时给予更大伤害。"),
    // 镜面属性
    [512] = COMPOUND_STRING(
                "反射对手的属性，\n"
                "让自己也变成一样的属性。"),
    // 报仇
    [513] = COMPOUND_STRING(
                "为倒下的同伴报仇。如果上\n回合有同伴倒下威力会提高。"),
    // 搏命
    [514] = COMPOUND_STRING(
                "拼命攻击。自己陷入昏厥，\n给予自己目前HP等量伤害。"),
    // 传递礼物
    [515] = COMPOUND_STRING(
                "当对手未携带道具时，\n"
                "能够将携带道具交给对手。"),
    // 炼狱
    [516] = COMPOUND_STRING(
                "用烈焰包裹住对手攻击。\n"
                "让对手陷入灼伤状态。"),
    // 水之誓约
    [517] = COMPOUND_STRING(
                "用水柱攻击。如果和火组合\n威力会提高并生成彩虹。"),
    // 火之誓约
    [518] = COMPOUND_STRING(
                "用火柱攻击。如果和草组合\n威力会提高并生成火海。"),
    // 草之誓约
    [519] = COMPOUND_STRING(
                "用草柱攻击。如果和水组合\n威力会提高并生成湿地。"),
    // 伏特替换
    [520] = COMPOUND_STRING("在攻击之后急速返回，\n"
                "和后备宝可梦进行替换。"),
    // 虫之抵抗
    [521] = COMPOUND_STRING(
                "抵抗并攻击对手。\n"
                "会降低对手的特攻。"),
    // 重踏
    [522] = COMPOUND_STRING(
                "用力踩踏地面并攻击所有的\n"
                "宝可梦。会降低对方的速度。"),
    // 冰息
    [523] = COMPOUND_STRING("攻击必定会击中要害。"),
    // 龙尾
    [524] = COMPOUND_STRING("强制拉后备宝可梦上场。\n"
            "结束与野生宝可梦的战斗。"),
    // 自我激励
    [525] = COMPOUND_STRING(
                "激励自己，\n"
                "从而提高攻击和特攻。"),
    // 电网
    [526] = COMPOUND_STRING(
                "用电网捉住对手攻击。\n"
                "会降低对手的速度。"),
    // 疯狂伏特
    [527] = COMPOUND_STRING(
                "让电流覆盖全身，撞向对手\n攻击。自己也会受少许伤害。"),
    // 直冲钻
    [528] = COMPOUND_STRING(
                "像钢钻一样，边旋转身体边\n撞击对手。容易击中要害。"),
    // 二连劈
    [529] = COMPOUND_STRING(
                "用身体坚硬的部分拍打对手。\n"
                "连续2次给予伤害。"),
    // 爱心印章
    [530] = COMPOUND_STRING(
                "以可爱动作使对手疏忽，并\n强力一击。有时使对手畏缩。"),
    // 木角
    [531] = COMPOUND_STRING(
                "可以回复给予对手\n"
                "伤害的一半HP"),
    // 圣剑
    [532] = COMPOUND_STRING("无视对手的能力变化，\n"
                "直接给予伤害。"),
    // 贝壳刃
    [533] = COMPOUND_STRING(
                "用锋利的贝壳切斩对手攻击。\n"
                "有时会降低对手的防御。"),
    // 高温重压
    [534] = COMPOUND_STRING("自己比对手越重，\n"
            "威力越大。"),
    // 青草搅拌器
    [535] = COMPOUND_STRING(
                "用锋利叶片包裹住对手攻击。\n"
                "有时会降低对手的命中率。"),
    // 疯狂滚压
    [536] = COMPOUND_STRING(
                "旋转揉成团的身体压扁对手。\n"
                "有时会使对手畏缩。"),
    // 棉花防守
    [537] = COMPOUND_STRING(
                "用软绵绵的绒毛包裹住自身\n"
                "守护。巨幅提高自己的防御。"),
    // 暗黑爆破
    [538] = COMPOUND_STRING(
                "放出黑暗的冲击波攻击对手。\n"
                "有时会降低对手的命中率。"),
    // 精神击破
    [539] = COMPOUND_STRING("将念波实体化攻击对手。\n"
                "给予物理伤害。"),
    // 扫尾拍打
    [540] = COMPOUND_STRING(
                "用坚硬的尾巴拍打对手攻击。\n"
                "连续攻击2～5次。"),
    // 暴风
    [541] = COMPOUND_STRING(
                "将猛烈的暴风雪刮向对手攻击。\n"
                "有时会让对手陷入冰冻状态。"),
    // 爆炸头突击
    [542] = COMPOUND_STRING(
                "用厉害的爆炸头猛撞向对手。\n"
                "自己也会受到少许伤害。"),
    // 齿轮飞盘
    [543] = COMPOUND_STRING(
                "向对手投掷钢铁齿轮攻击。\n"
                "连续2次给予伤害。"),
    // 火焰弹
    [544] = COMPOUND_STRING("用熊熊烈火攻击自己\n"
                "所有宝可梦。有时造成灼伤。"),
    // 高科技光炮
    [545] = COMPOUND_STRING(
                "向对手放出光弹。\n"
                "属性会根据卡带不同而改变。"),
    // 古老之歌
    [546] = COMPOUND_STRING(
                "以古老之歌打动对手的内心\n攻击。有时让对手陷入睡眠状态。"),
    // 神秘之剑
    [547] = COMPOUND_STRING(
                "用长角切斩对手攻击。角上\n"
                "的神奇力量将给予物理伤害。"),
    // 冰封世界
    [548] = COMPOUND_STRING(
                "将冰冻的冷气吹向对手攻击。\n"
                "会降低对手的速度。"),
    // 雷击
    [549] = COMPOUND_STRING(
                "让强大电流覆盖全身，猛撞\n攻击。有时会让对手麻痹。"),
    // 青焰
    [550] = COMPOUND_STRING(
                "用美丽而激烈的青焰包裹\n"
                "住对手。有时会让对手灼伤。"),
    // 火之舞
    [551] = COMPOUND_STRING(
                "让火焰覆盖全身，振翅攻击。\n有时会提高自己的特攻。"),
    // 冰冻伏特
    [552] = COMPOUND_STRING(
                "用覆盖着电流的冰块，在第2\n回合冲撞。有时让对手麻痹。"),
    // 极寒冷焰
    [553] = COMPOUND_STRING(
                "用燃烧般强烈的冷气，在第2\n回合释放。有时会让对手灼伤。"),
    // 大声咆哮
    [554] = COMPOUND_STRING(
                "没完没了地大声斥责，\n"
                "从而降低对手的特攻。"),
    // 冰柱坠击
    [555] = COMPOUND_STRING(
                "用大冰柱激烈地撞向对手。\n"
                "有时会使对手畏缩。"),
    // Ｖ热焰
    [556] = COMPOUND_STRING(
            "从前额产生灼热火焰，舍身\n撞击。防御特防速度会降低。"),
    // 交错火焰
    [557] = COMPOUND_STRING(
                "释放出巨大火焰。受到巨大\n闪电影响时，招式威力会提高。"),
    // 交错闪电
    [558] = COMPOUND_STRING(
                "释放出巨大闪电。受到巨大\n火焰影响时，招式威力会提高。"),
    // 飞身重压
    [559] = COMPOUND_STRING(
                "从空中俯冲向对手。此招式\n"
                "兼具格斗属性和飞行属性。"),
    // 掀榻榻米
    [560] = COMPOUND_STRING(
                "将掀起来的榻榻米当作盾牌，\n防住己方免受招式伤害。"),
    // 打嗝
    [561] = COMPOUND_STRING(
                "朝着对手打嗝，并给予伤害。\n如果不吃树果则无法使出。"),
    // 耕地
    [562] = COMPOUND_STRING(
                "翻耕土地使草木更容易成长。\n会提高草宝可梦的攻击特攻。"),
    // 黏黏网
    [563] = COMPOUND_STRING(
                "在对手周围围上黏黏的网，\n"
                "降低换上的对手的速度。"),
    // 致命针刺
    [564] = COMPOUND_STRING(
                "如果使用此招式打倒对手，\n"
                "攻击会巨幅提高。"),
    // 潜灵奇袭
    [565] = COMPOUND_STRING("第1回合消失踪影，\n"
                "第2回合攻击对手。"),
    // 万圣夜
    [566] = COMPOUND_STRING(
                "邀请对手参加万圣夜。\n"
                "使对手被追加幽灵属性。"),
    // 战吼
    [567] = COMPOUND_STRING(
                "发出战吼威吓对手，\n"
                "从而降低对手的攻击和特攻。"),
    // 等离子浴
    [568] = COMPOUND_STRING(
                "将带电粒子扩散，使一般\n"
                "属性的招式变成电属性。"),
    // 抛物面充电
    [569] = COMPOUND_STRING(
                "给周围全体宝可梦造成伤害。\n"
                "可以回复给予伤害一半 HP。"),
    // 森林诅咒
    [570] = COMPOUND_STRING(
                "向对手施加森林咒术。\n"
                "中招的对手会被追加草属性。"),
    // 落英缤纷
    [571] = COMPOUND_STRING(
                "猛烈地刮起飞雪般的落花，\n攻击所有的宝可梦并给予伤害。"),
    // 冷冻干燥
    [572] = COMPOUND_STRING(
                "急剧冷冻对手，有时造成冰\n冻。对水宝可梦也效果绝佳。"),
    // 魅惑之声
    [573] = COMPOUND_STRING(
                "发出魅惑的叫声，给予对手\n精神伤害。攻击必定会命中。"),
    // 抛下狠话
    [574] = COMPOUND_STRING(
                "抛下狠话威吓对手，降低\n攻击特攻后，和后备进行替换。"),
    // 颠倒
    [575] = COMPOUND_STRING(
                "颠倒对手的所有能力变化，\n"
                "变成和原来相反的状态。"),
    // 吸取之吻
    [576] = COMPOUND_STRING("回复给予对手伤害的\n"
                "一半以上的HP。"),
    // 戏法防守
    [577] = COMPOUND_STRING(
                "用神奇力量防住的变化招式。\n"
                "但无法防住伤害招式的攻击。"),
    // 鲜花防守
    [578] = COMPOUND_STRING(
                "使用神奇的力量提高在场的\n所有草属性宝可梦的防御。"),
    // 青草场地
    [579] = COMPOUND_STRING(
                "生成5回合青草场地。地上\n宝可梦缓慢回复HP并强化草。"),
    // 薄雾场地
    [580] = COMPOUND_STRING(
                "生成5回合薄雾场地。地上\n宝可梦不会异常并强化妖精。"),
    // 输电
    [581] = COMPOUND_STRING(
                "对手使出招式前，如果输电，\n则该回合该招式变成电属性。"),
    // 嬉闹
    [582] = COMPOUND_STRING(
                "与对手嬉闹并攻击。\n"
                "有时会降低对手的攻击。"),
    // 妖精之风
    [583] = COMPOUND_STRING(
                "刮起妖精之风，\n"
                "吹向对手攻击。"),
    // 月亮之力
    [584] = COMPOUND_STRING(
                "借用月亮的力量攻击对手。\n"
                "有时会降低对手的特攻。"),
    // 爆音波
    [585] = COMPOUND_STRING(
                "通过震耳欲聋的爆炸声产生\n"
                "的破坏力，攻击所有宝可梦。"),
    // 妖精之锁
    [586] = COMPOUND_STRING(
                "通过封锁，下一回合\n"
                "所有宝可梦都无法逃走。"),
    // 王者盾牌
    [587] = COMPOUND_STRING(
                "防住攻击同时变为防御姿态。\n能够降低接触对手的攻击。"),
    // 和睦相处
    [588] = COMPOUND_STRING(
                "和对手和睦相处，使其失去\n战意，从而降低对手的攻击。"),
    // 密语
    [589] = COMPOUND_STRING(
                "和对手进行密语，使其失去\n专注，从而降低对手的特攻。"),
    // 钻石风暴
    [590] = COMPOUND_STRING(
                "掀起钻石风暴给予伤害。\n"
                "有时大幅提高自己的防御。"),
    // 蒸汽爆炸
    [591] = COMPOUND_STRING(
                "将滚烫的蒸汽喷向对手。\n"
                "有时会让对手灼伤。"),
    // 异次元洞
    [592] = COMPOUND_STRING("Uses a warp hole to attack.\n"
                "Can't be evaded."),
    // 飞水手里剑
    [593] = COMPOUND_STRING(
                "用粘液制成的手里剑，连续\n攻击2～5次。必定先制攻击。"),
    // 魔法火焰
    [594] = COMPOUND_STRING(
                "从口中喷出特别灼热的火焰\n"
                "攻击。降低对手的特攻。"),
    // 尖刺防守
    [595] = COMPOUND_STRING(
                "防住对手攻击的同时，\n"
                "削减接触到的对手的体力。"),
    // 芳香薄雾
    [596] = COMPOUND_STRING(
                "通过神奇的芳香，\n"
                "提高我方宝可梦的特防。"),
    // 怪异电波
    [597] = COMPOUND_STRING(
                "从身体放射出怪异电波，\n大幅降低对手特攻。"),
    // 毒液陷阱
    [598] = COMPOUND_STRING(
                "将特殊毒液泼向对手。降低\n中毒对手的攻击特攻和速度。"),
    // 粉尘
    [599] = COMPOUND_STRING(
                "如果被撒到粉尘的对手使用\n"
                "火招式，则会爆炸造成伤害。"),
    // 大地掌控
    [600] = COMPOUND_STRING(
                "第1回合吸收能量，第2回合\n"
                "大幅提高特攻、特防和速度。"),
    // 磁场操控
    [601] = COMPOUND_STRING(
                "通过操控磁场，会提高特性\n"
                "为正负电宝可梦的防御特防。"),
    // 欢乐时光
    [602] = COMPOUND_STRING(
                "如果使用欢乐时光，\n"
                "战斗后得到的钱会翻倍。"),
    // 电气场地
    [603] = COMPOUND_STRING(
                "生成5回合电气场地。地上\n宝可梦不会睡眠并强化电。"),
    // 魔法闪耀
    [604] = COMPOUND_STRING(
                "向对手发射强光，\n"
                "并给予伤害。"),
    // 庆祝
    [605] = COMPOUND_STRING(
                "宝可梦为十分开心\n的你庆祝。"),
    // 牵手
    [606] = COMPOUND_STRING(
                "我方宝可梦之间牵手。\n"
                "能带来非常幸福的心情。"),
    // 圆瞳
    [607] = COMPOUND_STRING(
                "用圆瞳凝视对手，从而降低\n其攻击。必定先制攻击。"),
    // 蹭蹭脸颊
    [608] = COMPOUND_STRING(
                "将带电的脸颊蹭蹭对手攻击。\n"
                "让对手陷入麻痹状态。"),
    // 手下留情
    [609] = COMPOUND_STRING(
        "对手至少会留下1HP，\n"
        "如此般手下留情地攻击。"
        ),
    // 死缠烂打
    [610] = COMPOUND_STRING(
                "在4～5回合内死缠烂打攻击。\n"
                "在此期间对手将无法逃走。"),
    // 增强拳
    [611] = COMPOUND_STRING(
                "通过反复击打对手，使拳头\n变硬。打中后攻击就会提高。"),
    // 死亡之翼
    [612] = COMPOUND_STRING("回复给予对手伤害的\n"
                "一半以上的HP。"),
    // 千箭齐发
    [613] = COMPOUND_STRING(
                "可以击中浮在空中的宝可梦。\n被击落后对手会掉到地面。"),
    // 千波激荡
    [614] = COMPOUND_STRING(
                "从地面掀起波浪攻击。\n被掀入的对手，将无法逃走。"),
    // 大地神力
    [615] = COMPOUND_STRING(
                "聚集大地的力量，将此力量\n集中攻击对手，并给予伤害。"),
    // 破灭之光
    [616] = COMPOUND_STRING(
                "借用永恒之花的力量，发射\n强力光线。自己也会受伤害。"),
    // 根源波动
    [617] = COMPOUND_STRING(
                "用无数青白色且闪耀的\n光线攻击对手。"),
    // 断崖之剑
    [618] = COMPOUND_STRING(
                "将大地的力量变化为\n利刃攻击对手。"),
    // 画龙点睛
    [619] = COMPOUND_STRING("强力攻击，但是自己的\n"
                "防御和特防会降低。"),
    // 异次元猛攻
    [620] = COMPOUND_STRING("Uses a warp hole to attack.\n"
                "Can't be evaded."),
    // 集沙
    [621] = COMPOUND_STRING(
                "回复自己最大HP的一半。\n"
                "在沙暴中回复得更多。"),
    // 迎头一击
    [622] = COMPOUND_STRING(
                "威力很高的招式，但仅在\n出场时，立刻使出才能成功。"),
    // 碉堡
    [623] = COMPOUND_STRING(
                "防住对手攻击的同时，\n"
                "让接触到自己的对手中毒。"),
    // 缝影
    [624] = COMPOUND_STRING(
                "攻击的同时，缝住对手的\n影子，使其无法逃走。"),
    // ＤＤ金勾臂
    [625] = COMPOUND_STRING(
            "旋转双臂打向对手。无视\n能力变化，直接给予伤害。"),
    // 泡影的咏叹调
    [626] = COMPOUND_STRING(
                "随着唱歌会放出很多气球。\n受此招式攻击时会治愈灼伤。"),
    // 冰锤
    [627] = COMPOUND_STRING(
                "挥舞强力而沉重的拳头，\n造成伤害。自己速度会降低。"),
    // 花疗
    [628] = COMPOUND_STRING(
                "回复对手最大HP的一半。在\n青草场地时，效果会提高。"),
    // 十万马力
    [629] = COMPOUND_STRING(
                "使出全身力量，\n"
                "猛攻对手。"),
    // 吸取力量
    [630] = COMPOUND_STRING(
                "回复和对手攻击力同数值\n"
                "HP，然后降低对手攻击。"),
    // 日光刃
    [631] = COMPOUND_STRING(
                "第1回合收集日光，\n第2"
                "回合将力量集中在剑上攻击。"),
    // 树叶
    [632] = COMPOUND_STRING(
                "将叶片打向对手攻击。"),
    // 聚光灯
    [633] = COMPOUND_STRING(
                "给宝可梦打上聚光灯，\n"
                "该回合只能瞄准该宝可梦。"),
    // 毒丝
    [634] = COMPOUND_STRING(
                "将混有毒的丝吐向对手。\n使其中毒并降低对手的速度。"),
    // 磨砺
    [635] = COMPOUND_STRING(
                "集中精神，\n"
                "下次攻击必定会击中要害。"),
    // 辅助齿轮
    [636] = COMPOUND_STRING(
                "启动齿轮，提高特性正负电\n"
                "宝可梦的攻击和特攻。"),
    // 地狱突刺
    [637] = COMPOUND_STRING(
                "受击对手会因地狱般的痛苦，\n2回合内无法使出声音招式。"),
    // 花粉团
    [638] = COMPOUND_STRING(
                "对敌人使用是会爆炸的团子。\n"
                "对我方使用是给予回复团子。"),
    // 掷锚
    [639] = COMPOUND_STRING(
                "将锚缠住对手攻击。\n"
                "使对手无法逃走。"),
    // 精神场地
    [640] = COMPOUND_STRING(
                "生成5回合精神场地。地上\n宝可梦免疫先制并强化超能。"),
    // 猛扑
    [641] = COMPOUND_STRING(
                "全力猛扑对手攻击。\n"
                "从而降低对手的攻击。"),
    // 火焰鞭
    [642] = COMPOUND_STRING(
                "用燃烧的鞭子抽打对手。\n"
                "受到攻击的对手防御会降低。"),
    // 嚣张
    [643] = COMPOUND_STRING(
                "耀武扬威地攻击对手，\n能力提高得越多威力就越大。"),
    // 燃尽
    [644] = COMPOUND_STRING(
                "将自己全身燃烧起火焰来\n攻击。自身火属性会消失。"),
    // 速度互换
    [645] = COMPOUND_STRING(
                "将对手和自己的速度\n进行互换。"),
    // 修长之角
    [646] = COMPOUND_STRING(
                "用尖尖的角刺入对手攻击。\n"
                "攻击必定会命中。"),
    // 净化
    [647] = COMPOUND_STRING(
                "治愈对手的异常状态。\n"
                "治愈后可以回复自己的HP。"),
    // 觉醒之舞
    [648] = COMPOUND_STRING(
                "全力跳舞攻击。\n"
                "属性将变得和自身属性相同。"),
    // 核心惩罚者
    [649] = COMPOUND_STRING(
                "如果给予过伤害的对手已经\n"
                "结束行动，其特性会被消除。"),
    // 热带踢
    [650] = COMPOUND_STRING(
                "向对手使出来自南国的火热\n"
                "脚踢。从而降低对手的攻击。"),
    // 号令
    [651] = COMPOUND_STRING(
                "向对手下达指示，\n"
                "让其再次使出刚才的招式。"),
    // 鸟嘴加农炮
    [652] = COMPOUND_STRING(
                "先加热鸟嘴后再攻击。鸟嘴\n在加热时对手触碰会灼伤。"),
    // 鳞片噪音
    [653] = COMPOUND_STRING(
                "摩擦全身鳞片发出响亮声音\n攻击。之后自身防御会降低。"),
    // 龙锤
    [654] = COMPOUND_STRING(
                "将身体当作锤子，向对手\n发动袭击，给予伤害。"),
    // 狂舞挥打
    [655] = COMPOUND_STRING(
                "用自己的身体狂舞挥打，\n"
                "给予对手伤害。"),
    // 极光幕
    [656] = COMPOUND_STRING(
                "在5回合内减弱物理和特殊\n"
                "伤害。只有下雪时才能使出。"),
    // 陷阱甲壳
    [657] = COMPOUND_STRING(
                "设下甲壳陷阱。若对手使出\n物理招式，陷阱就会爆炸攻击。"),
    // 花朵加农炮
    [658] = COMPOUND_STRING(
                "放出强力光束后，\n"
                "自己的特攻会大幅降低。"),
    // 精神之牙
    [659] = COMPOUND_STRING(
                "利用精神力量咬住对手攻击。\n"
                "还可以破坏光墙和反射壁等。"),
    // 跺脚
    [660] = COMPOUND_STRING(
                "化悔恨为力量攻击。若上回\n合招式没打中威力就会翻倍。"),
    // 暗影之骨
    [661] = COMPOUND_STRING(
                "用附有灵魂骨头殴打对手。\n"
                "有时会降低对手的防御。"),
    // 冲岩
    [662] = COMPOUND_STRING(
                "迅速撞向对手攻击。\n"
                "必定能够先制攻击。"),
    // 水流裂破
    [663] = COMPOUND_STRING(
                "用水之力量撞向对手攻击。\n"
                "有时会降低对手的防御。"),
    // 棱镜镭射
    [664] = COMPOUND_STRING(
                "用棱镜的力量发射强烈光线。\n"
                "下一回合自己将无法动弹。"),
    // 暗影偷盗
    [665] = COMPOUND_STRING(
                "潜入对手的影子攻击。\n"
                "会夺取对手的能力提升。"),
    // 流星闪冲
    [666] = COMPOUND_STRING(
                "以流星般的气势猛撞对手。\n"
                "可以无视对手的特性攻击。"),
    // 暗影之光
    [667] = COMPOUND_STRING(
                "放出奇怪的光线攻击对手。\n"
                "可以无视对手的特性攻击。"),
    // 泪眼汪汪
    [668] = COMPOUND_STRING(
                "变得泪眼汪汪，让对手丧失\n斗志。降低对手的攻击特攻。"),
    // 麻麻刺刺
    [669] = COMPOUND_STRING(
                "撞向对手并发出强电，使其\n麻麻刺刺。有时造成畏缩。"),
    // 自然之怒
    [670] = COMPOUND_STRING(
                "向对手释放自然之怒。\n"
                "对手的HP会减半。"),
    // 多属性攻击
    [671] = COMPOUND_STRING(
                "覆盖高能量并撞向对手攻击。\n属性会根据携带存储碟改变。"),
    // 惊爆大头
    [672] = COMPOUND_STRING(
                "让自己的头爆炸，来攻击\n一切。自己也会受到伤害。"),
    // 等离子闪电拳
    [673] = COMPOUND_STRING(
                "用覆盖着电流拳头攻击。使\n"
                "一般属性招式变成电属性。"),
    // 光子喷涌
    [674] = COMPOUND_STRING(
                "用光柱来攻击。用物攻特攻\n数值更高的一项造成伤害。"),
    // 电电加速
    [675] = COMPOUND_STRING(
                "迅猛无比的电击。必定能够\n先制攻击并击中要害。"),
    // 滔滔冲浪
    [676] = COMPOUND_STRING(
                "往巨浪中注入电能后冲撞。\n"
                "有时会让对手陷入麻痹状态。"),
    // 飘飘坠落
    [677] = COMPOUND_STRING(
                "轻飘飘地浮起来后猛地俯冲\n攻击。有时会使对手畏缩。"),
    // 闪闪雷光
    [678] = COMPOUND_STRING(
                "皮卡丘越喜欢训练家，电击\n威力越强。攻击必定会命中。"),
    // 活活气泡
    [679] = COMPOUND_STRING(
                "投掷水球攻击。能回复\n"
                "造成的伤害一半的 HP。"),
    // 麻麻电击
    [680] = COMPOUND_STRING(
                "放出电击攻击对手。\n"
                "让对手陷入麻痹状态。"),
    // 熊熊火爆
    [681] = COMPOUND_STRING(
                "用燃烧的身体猛烈地冲撞。\n"
                "让对手陷入灼伤状态。"),
    // 哗哗气场
    [682] = COMPOUND_STRING(
                "利用念力强攻粉碎对方信心。\n制造能减弱特殊攻击的墙壁。"),
    // 坏坏领域
    [683] = COMPOUND_STRING(
                "恶行恶相地进行攻击。\n制造能减弱物理攻击的墙壁。"),
    // 茁茁轰炸
    [684] = COMPOUND_STRING(
                "长出巨大藤蔓播撒种子攻击。\n种子会每回合吸取对手 HP。"),
    // 冰冰霜冻
    [685] = COMPOUND_STRING(
                "利用冰冷的黑雾结晶攻击。\n"
                "使全体宝可梦能力变回原点。"),
    // 亮亮风暴
    [686] = COMPOUND_STRING(
                "利用芬芳的龙卷风吞噬对方。\n"
                "能治愈我方宝可梦异常状态。"),
    // 砰砰击破
    [687] = COMPOUND_STRING(
                "伊布越喜欢训练家，冲撞的\n威力越强。攻击必定会命中。"),
    // 钢拳双击
    [688] = COMPOUND_STRING(
                "以胸口的螺帽为中心旋转，\n连续2次攻击。有时造成畏缩。"),
    // 极巨炮
    [689] = COMPOUND_STRING(
                "将凝缩在体内的能量从\n核心放出攻击。"),
    // 狙击
    [690] = COMPOUND_STRING(
                "无视吸引类特性及招式影响。\n"
                "可以向选定的对手攻击。"),
    // 紧咬不放
    [691] = COMPOUND_STRING(
                "直到双方之一昏厥为止无法\n"
                "替换。其中一方退场后解除。"),
    // 大快朵颐
    [692] = COMPOUND_STRING(
                "吃掉携带的树果，\n"
                "大幅提高防御。"),
    // 背水一战
    [693] = COMPOUND_STRING(
                "提高自己的所有能力，\n"
                "但无法替换或逃走。"),
    // 沥青射击
    [694] = COMPOUND_STRING(
                "泼洒黏糊糊沥青，降低对手\n速度。火属性会变成弱点。"),
    // 魔法粉
    [695] = COMPOUND_STRING(
                "向对手喷洒魔法粉，\n"
                "使对手变为超能力属性。"),
    // 龙箭
    [696] = COMPOUND_STRING(
                "让多龙梅西亚进行2次攻击。\n若对手有2只则会分别攻击。"),
    // 茶会
    [697] = COMPOUND_STRING(
                "举办一场茶会，场上的所有\n"
                "宝可梦都会吃掉携带的树果。"),
    // 蛸固
    [698] = COMPOUND_STRING(
                "让对手无法逃走。对手被固定\n后，每回合会降低防御特防。"),
    // 电喙
    [699] = COMPOUND_STRING(
                "用带电的喙啄刺对手。如果\n先手攻击，威力会变成2倍。"),
    // 鳃咬
    [700] = COMPOUND_STRING(
                "用坚硬的腮咬住对手。如果\n先手攻击，威力会变成2倍。"),
    // 换场
    [701] = COMPOUND_STRING(
                "用神奇力量瞬间移动与同伴\n交换位置。连续使出容易失败。"),
    // 魂舞烈音爆
    [702] = COMPOUND_STRING(
                "削减少许自己的HP，\n"
                "使所有能力都提高。"),
    // 扑击
    [703] = COMPOUND_STRING(
                "用身体撞向对手攻击。防御\n越高，给予的伤害就越高。"),
    // 装饰
    [704] = COMPOUND_STRING(
                "通过装饰，\n"
                "大幅提高对方的攻击和特攻。"),
    // 鼓击
    [705] = COMPOUND_STRING(
                "用鼓点来控制鼓的根部攻击，\n"
                "从而降低对手的速度。"),
    // 捕兽夹
    [706] = COMPOUND_STRING(
                "使用捕兽夹，在4～5回合内，\n夹住对手攻击。"),
    // 火焰球
    [707] = COMPOUND_STRING(
                "点燃石子形成火球攻击对手。\n有时会使对手陷入灼伤状态。"),
    // 巨兽斩
    [708] = COMPOUND_STRING(
                "以全身力气举起强大的剑，\n"
                "猛烈地劈向对手攻击。"),
    // 巨兽弹
    [709] = COMPOUND_STRING(
                "将全身变化为坚固的盾，\n"
                "猛烈地撞向对手攻击。"),
    // 气场轮
    [710] = COMPOUND_STRING(
                "用储存在颊囊里的能量攻击，\n提升速度。属性随样子改变。"),
    // 广域破坏
    [711] = COMPOUND_STRING(
                "用坚韧的尾巴猛扫对手攻击，\n"
                "从而降低对手的攻击。"),
    // 木枝突刺
    [712] = COMPOUND_STRING(
                "使用尖锐的树枝刺向\n对手攻击。"),
    // 破音
    [713] = COMPOUND_STRING(
                "奏响吉他和贝斯，释放出\n"
                "发出巨响的剧烈震动攻击。"),
    // 苹果酸
    [714] = COMPOUND_STRING(
                "使用从酸苹果中提取出来的\n"
                "液体攻击。降低对手的特防。"),
    // 万有引力
    [715] = COMPOUND_STRING(
                "从高处落下苹果，给予对手\n伤害。可降低对手的防御。"),
    // 灵魂冲击
    [716] = COMPOUND_STRING(
                "用能让对手一蹶不振的气势\n"
                "攻击。会降低对手的特攻。"),
    // 神奇蒸汽
    [717] = COMPOUND_STRING(
                "喷出烟雾攻击对手。\n"
                "有时会使对手混乱。"),
    // 生命水滴
    [718] = COMPOUND_STRING(
                "喷洒出神奇的水，\n"
                "回复自己和场上同伴的HP。"),
    // 拦堵
    [719] = COMPOUND_STRING(
                "完全抵挡攻击。连续用容易\n失败。触碰会大幅降低防御。"),
    // 假跪真撞
    [720] = COMPOUND_STRING(
                "装作低头认错的样子用凌乱\n的头发突刺。攻击必定命中。"),
    // 流星突击
    [721] = COMPOUND_STRING(
                "大力挥舞粗壮的茎攻击。\n但下一回合自己将无法动弹。"),
    // 无极光束
    [722] = COMPOUND_STRING(
                "无极汰那变回原来样子攻击，\n下一回合自己将无法动弹。"),
    // 铁蹄光线
    [723] = COMPOUND_STRING(
                "将从全身聚集钢铁化为光束，\n激烈地发射。自己也会受伤。"),
    // 广域战力
    [724] = COMPOUND_STRING(
                "用精神力量攻击。精神场地\n上威力提升且目标变为全体。"),
    // 铁滚轮
    [725] = COMPOUND_STRING(
                "在破坏场地的同时攻击对手。\n脚下没有任何场地便会失败。"),
    // 鳞射
    [726] = COMPOUND_STRING(
                "发射鳞片攻击。连续攻击2～\n5次。提高速度但降低防御。"),
    // 流星光束
    [727] = COMPOUND_STRING(
                "第1回合聚集宇宙之力提高\n"
                "特攻，第2回合攻击对手。"),
    // 臂贝武器
    [728] = COMPOUND_STRING(
                "用物攻特攻数值更高的一项\n"
                "攻击。有时会让对手中毒。"),
    // 薄雾炸裂
    [729] = COMPOUND_STRING(
                "对所有宝可梦攻击后昏厥。\n在薄雾场地上威力会提高。"),
    // 青草滑梯
    [730] = COMPOUND_STRING(
                "仿佛在地面上滑行般地攻击。在\n青草场地上必定能够先制。"),
    // 电力上升
    [731] = COMPOUND_STRING(
                "从地面升起电击攻击。对手\n在电气场地上威力变成2倍。"),
    // 大地波动
    [732] = COMPOUND_STRING(
                "借助场地的力量攻击。\n视场地改变属性和威力。"),
    // 爬击
    [733] = COMPOUND_STRING(
                "从对手背后爬近后攻击。\n"
                "会降低对手的特攻。"),
    // 妒火
    [734] = COMPOUND_STRING(
                "用嫉妒能量攻击对手。回合\n"
                "内能力提高的宝可梦会灼伤。"),
    // 泄愤
    [735] = COMPOUND_STRING(
                "发泄恼怒情绪。若回合自身\n内能力降低，威力变成2倍。"),
    // 灵骚
    [736] = COMPOUND_STRING(
                "操纵对手持有物攻击。\n当对手没有道具时会失败。"),
    // 腐蚀气体
    [737] = COMPOUND_STRING(
                "用强酸性气体包裹所有宝可\n"
                "梦，并融化其所携带的道具。"),
    // 指导
    [738] = COMPOUND_STRING(
                "通过进行正确合理的指导，\n"
                "提高我方全员的攻击和防御。"),
    // 快速折返
    [739] = COMPOUND_STRING(
                "在攻击之后急速返回，\n"
                "和后备宝可梦进行替换。"),
    // 三旋击
    [740] = COMPOUND_STRING(
                "连续3次踢对手攻击。每\n踢中一次，威力就会提高。"),
    // 双翼
    [741] = COMPOUND_STRING(
                "将翅膀撞向对手攻击。\n"
                "连续2次给予伤害。"),
    // 热沙大地
    [742] = COMPOUND_STRING(
                "将滚烫的沙子砸向对手攻击。\n"
                "有时会让对手陷入灼伤状态。"),
    // 丛林治疗
    [743] = COMPOUND_STRING(
                "与丛林融为一体，回复自己\n"
                "和场上同伴的HP和状态。"),
    // 暗冥强击
    [744] = COMPOUND_STRING(
                "将恶之流派修炼至大成的\n"
                "猛烈一击。必定击中要害。"),
    // 水流连打
    [745] = COMPOUND_STRING(
                "将水之流派修炼至大成的\n"
                "的3次连击。必定击中要害。"),
    // 雷电囚笼
    [746] = COMPOUND_STRING(
                "将对手困在电流四溅囚笼中，\n"
                "在4～5回合内攻击。"),
    // 巨龙威能
    [747] = COMPOUND_STRING(
                "把生命力转换为力量攻击。\n自身HP越少招式威力越小。"),
    // 冰冷视线
    [748] = COMPOUND_STRING(
                "从双眼发射精神力量攻击。\n"
                "有时会让对手陷入冰冻状态。"),
    // 怒火中烧
    [749] = COMPOUND_STRING(
                "将愤怒转化为火焰般的气场\n"
                "攻击。有时会使对手畏缩。"),
    // 雷鸣蹴击
    [750] = COMPOUND_STRING(
                "以雷电般的动作戏耍对手并\n"
                "使出脚踢。可降低对手防御。"),
    // 雪矛
    [751] = COMPOUND_STRING(
                "向对手投掷掀起暴风雪\n的冰矛攻击。"),
    // 星碎
    [752] = COMPOUND_STRING(
                "用大量的小灵体向对手\n发起攻击。"),
    // 诡异咒语
    [753] = COMPOUND_STRING(
                "用强大的精神力量攻击。让\n"
                "对手最后用的招式减少3PP。"),
    // 魅诱之声
    [754] = COMPOUND_STRING(
                "用天使般的歌声攻击。让此\n"
                "回合能力提高的宝可梦混乱。"),
    // 波动冲
    [755] = COMPOUND_STRING(
                "让水覆盖全身后撞向对手。\n"
                "自己也会受到不少伤害。"),
    // 巨力锤
    [756] = COMPOUND_STRING(
                "连同身体转起巨大锤子攻击。\n"
                "这个招式无法连续使出2次。"),
    // 水波刀
    [757] = COMPOUND_STRING(
                "如刀刃般喷射出加压的水\n"
                "切开对手。容易击中要害。"),
    // 流水旋舞
    [758] = COMPOUND_STRING(
                "以盈盈欲滴的轻快步伐戏耍\n"
                "攻击。会提高自己的速度。"),
    // 铠农炮
    [759] = COMPOUND_STRING(
                "燃烧自身铠甲化作炮弹攻击，\n自己的防御和特防会降低。"),
    // 下压踢
    [760] = COMPOUND_STRING(
                "踢起脚跟劈向对手。有时造\n成混乱。若劈偏会受到伤害。"),
    // 悔念剑
    [761] = COMPOUND_STRING(
                "将世间留恋聚集于剑尖斩击。\n可以回复给予伤害一半HP。"),
    // 灼热暴冲
    [762] = COMPOUND_STRING(
                "--\n-"),
    // 血月
    [763] = COMPOUND_STRING(
                "从赤红如血满月发射出全部\n"
                "气势。无法连续使出2次。"),
    // 火焰守护
    [764] = COMPOUND_STRING(
                "用超高温的体毛防住攻击，\n"
                "同时让接触的对手灼伤。"),
    // 泼冷水
    [765] = COMPOUND_STRING(
                "泼洒冰冷得足以让对手失去\n"
                "活力的水。会降低对手攻击。"),
    // 冷笑话
    [766] = COMPOUND_STRING(
                "留下冷场的冷笑话后换下。\n在5回合内会下雪。"),
    // 全开猛撞
    [767] = COMPOUND_STRING(
                "边变形边凶暴地落下，引发\n起大爆炸。克制时威力提升。"),
    // 格斗暴冲
    [768] = COMPOUND_STRING(
                "--\n-"),
    // 复仇
    [769] = COMPOUND_STRING(
                "使出招式前，将最后受到的\n"
                "招式的伤害大力返还给对手。"),
    // 描绘
    [770] = COMPOUND_STRING(
                "把握并映射出对手本质，让\n"
                "己方宝可梦变为同样的特性。"),
    // 电光双击
    [771] = COMPOUND_STRING(
                "将全身所有的电力放出攻击，\n自己的电属性将会消失。"),
    // 龙声鼓舞
    [772] = COMPOUND_STRING(
                "鼓舞士气让招式变得容易击\n中要害。对龙属性效果更强。"),
    // 闪电猛冲
    [773] = COMPOUND_STRING(
                "边变形边高速奔走，以未知\n电击贯穿。克制时威力提升。"),
    // 电光束
    [774] = COMPOUND_STRING(
                "向对手发射电击光束。\n有时会提高自己的特攻。"),
    // 随机光
    [775] = COMPOUND_STRING(
                "发射光线攻击。有时其\n他头会合力，威力变成2倍。"),
    // 甩肉
    [776] = COMPOUND_STRING(
                "削减自己的HP，\n"
                "大幅提高攻击特攻及速度。"),
    // 千变万花
    [777] = COMPOUND_STRING(
                "将做了手脚的花束扔向对手\n攻击。必定命中且击中要害。"),
    // 巨剑突击
    [778] = COMPOUND_STRING(
                "蛮勇地舍身突击。之后对手\n攻击必中且伤害变成2倍。"),
    // 硬压
    [779] = COMPOUND_STRING("对手的HP越多，\n"
            "威力越大。"),
    // 水蒸气
    [780] = COMPOUND_STRING(
                "将沸腾的开水猛烈喷向对手。\n晴天时招式威力反而会提升。"),
    // 强力钻
    [781] = COMPOUND_STRING(
                "急速旋转尖锐身体部位贯穿。\n"
                "可以无视守住和看穿等招式。"),
    // 冰旋
    [782] = COMPOUND_STRING(
                "脚上覆盖薄冰，旋转着撞击\n对手。用旋转动作破坏场地。"),
    // 棘藤棒
    [783] = COMPOUND_STRING(
                "用缠藤的棍棒殴打。属性会\n随面具改变。容易击中要害。"),
    // 喷射拳
    [784] = COMPOUND_STRING(
                "拳头缠绕激流，以超越目光\n的速度拳击。必定先制攻击。"),
    // 仆斩
    [785] = COMPOUND_STRING(
            "下跪让对手大意后发起袭击\n"
            "劈向对手。攻击必定会命中。"),
    // 扫墓
    [786] = COMPOUND_STRING(
                "为化解悔恨攻击。被打倒的\n我方宝可梦越多，威力越高。"),
    // 琉光冲激
    [787] = COMPOUND_STRING(
                "放出能影响精神的奇妙怪光\n"
                "攻击。会大幅降低对方特防。"),
    // 魔法暴冲
    [788] = COMPOUND_STRING(
                "--\n-"),
    // 淘金潮
    [789] = COMPOUND_STRING(
                "抛大量硬币攻击。自身特攻\n会降低，战斗后会拿到钱。"),
    // 邪毒锁链
    [790] = COMPOUND_STRING(
                "用毒锁链缠住对手加以侵蚀。\n"
                "有时会让对手陷入剧毒状态。"),
    // 刷刷茶炮
    [791] = COMPOUND_STRING(
                "发射茶大炮，可以回复伤害\n一半HP，有时造成灼伤。"),
    // 强刃攻击
    [792] = COMPOUND_STRING("能够攻击使用守住类招式的\n"
                "对手。解除其守护效果。"),
    // 晶光转转
    [793] = COMPOUND_STRING(
                "旋转攻击对手。可摆脱绑紧\n类招式。还能让对手中毒。"),
    // 剧毒暴冲
    [794] = COMPOUND_STRING(
                "--\n-"),
    // 上菜
    [795] = COMPOUND_STRING(
                "以潇洒的身手攻击。若口中\n有米立龙会按其提高能力。"),
    // 鼠数儿
    [796] = COMPOUND_STRING(
                "伙伴们会纷纷赶来，以群体\n攻击。连续命中1～10次。"),
    // 虫扑
    [797] = COMPOUND_STRING(
                "飞扑向对手攻击。\n"
                "会降低对手的速度。"),
    // 精神剑
    [798] = COMPOUND_STRING(
                "用无形的利刃劈开对手。\n在电气场地上招式威力提升。"),
    // 精神噪音
    [799] = COMPOUND_STRING(
                "用令对手不舒服的音波攻击。\n"
                "让对手2回合内无法回复HP。"),
    // 愤怒之拳
    [800] = COMPOUND_STRING(
                "将愤怒化为力量攻击。受到\n攻击次数越多，威力越高。"),
    // 怒牛
    [801] = COMPOUND_STRING(
                "狂怒猛烈冲撞。属性随形态\n改变，墙壁类招式也能破坏。"),
    // 复生祈祷
    [802] = COMPOUND_STRING(
                "以慈爱之心祈祷，让昏厥的\n"
                "宝可梦回复一半HP后复活。"),
    // 大灾难
    [803] = COMPOUND_STRING(
                "引发毁灭性的灾厄，\n"
                "使对手的HP减半。"),
    // 盐腌
    [804] = COMPOUND_STRING(
                "使对手陷入盐腌每回合受伤。\n对手为钢或水属性会更痛苦。"),
    // 断尾
    [805] = COMPOUND_STRING(
                "削减自己的HP，制造分身后\n会返回与后备宝可梦替换。"),
    // 线阱
    [806] = COMPOUND_STRING(
                "用丝设置陷阱防住对方攻击，\n并能够降低接触的对手速度。"),
    // 雪景
    [807] = COMPOUND_STRING(
                "在5回合内会下雪。\n"
                "冰属性的防御会提高。"),
    // 辣椒精华
    [808] = COMPOUND_STRING(
                "放出极为辛辣的精华。对手\n攻击大幅提高防御大幅降低。"),
    // 疾速转轮
    [809] = COMPOUND_STRING(
                "以往腿上增加负荷激烈旋转\n攻击，自身速度会大幅降低。"),
    // 闪电强袭
    [810] = COMPOUND_STRING(
                "让身体带电后压向对手。\n"
                "如果未命中则自身受伤。"),
    // 糖浆炸弹
    [811] = COMPOUND_STRING(
                "引爆糖浆让对手陷入满身糖，\n在3回合内持续降低速度。"),
    // 迅子利刃
    [812] = COMPOUND_STRING(
                "接连发射出粒子刃，连续\n2次攻击。必定会命中。"),
    // 豁出去
    [813] = COMPOUND_STRING(
                "以自暴自弃的气势攻击。\n若上回合未命中则威力翻倍。"),
    // 太晶爆发
    [814] = COMPOUND_STRING(
                "太晶化时以太晶属性攻击。\n用攻击特攻更高的一项攻击。"),
    // 晶光星群
    [815] = COMPOUND_STRING(
                "照射出结晶力量来驱逐敌人。\n星晶形态下能攻击所有对手。"),
    // 迅雷
    [816] = COMPOUND_STRING("能比对手先攻击。对手招式\n"
            "如果不是攻击招式则会失败。"),
    // 大扫除
    [817] = COMPOUND_STRING(
                "将替身与撒菱等招式扫除掉。\n"
                "自己的攻击和速度会提高。"),
    // 起草
    [818] = COMPOUND_STRING(
                "跳出草丛攻击。通过轻快\n"
                "的步伐会提高自己的速度。"),
    // 三连钻
    [819] = COMPOUND_STRING(
                "以默契的跳跃溅起水花攻击。\n"
                "连续3次给予伤害。"),
    // 双光束
    [820] = COMPOUND_STRING(
                "从两眼发射出神奇光线攻击。\n"
                "连续2次给予伤害。"),
    // 快手还击
    [821] = COMPOUND_STRING(
                "察觉动作后攻击让对手畏缩。\n若对手招式不是先制会失败。"),
    // 黑暗暴冲
    [822] = COMPOUND_STRING(
                "--\n-"),
    // Neutral Pulse
    [823] = COMPOUND_STRING(
                "--\n-"),
    // Seasonal Beam
    [824] = COMPOUND_STRING(
                "--\n-"),
    // 大愤慨
    [825] = COMPOUND_STRING(
                "在2～3回合内放出火焰疯狂\n乱打。大闹一番后陷入混乱。"),
};
